{"gender": "male", "appearance": 5, "ethnicity": "Mixed", "education": "Bachelor's", "hobbies": ["weed culture", "watch collecting", "confrontational protesting"], "income": "Middle income", "personality": "INTJ", "writing_style": ["Emotionally intense poet type", "Playful and flirty"], "issues": ["Excessive flirting"], "username": "user6073_wild", "about_me": "In the depths of my soul, a maelstrom of passion and rebellion brews. By day, I'm a visionary with a bachelor's degree and a 9-to-5 that fuels my creative pursuits. By night, I'm a wordsmith, weaving tales of social justice and revolution. My heart beats for the rhythm of protest chants and the sweet, sweet smoke of the cannabis culture. I collect timepieces that tick like the clock of justice, reminding me that every moment is a chance to challenge the status quo. When I'm not rallying for a cause, you can find me lost in the pages of a poetry book or crafting my own verse. I'm a seeker of truth, a teller of tales, and a weaver of dreams. If you're ready to join me on this wild, winding road, let's get lost together. Warning: I may just steal your heart with my words, and your attention with my gaze.", "name": "\"RebelTimekeeper\""}
{"gender": "male", "appearance": 5, "ethnicity": "Hispanic", "education": "Associate's", "hobbies": ["watching ASMR", "working out", "gossiping in DMs"], "income": "Middle income", "personality": "INTP", "writing_style": ["Introvert pretending to be extrovert", "Overshares way too early"], "issues": ["Hyper political rants"], "username": "user4865_sweet", "about_me": "Hey, hello, hi, it's me, and I'm so excited to be here. I mean, I'm really excited. Like, I've been thinking about this profile for weeks, and I've written and rewritten this \"about me\" section so many times, I've lost count. But, here it goes. I'm a Hispanic guy, born and raised in the city, with an Associate's degree in... well, let's just say it's not as exciting as my personality. When I'm not working my 9-to-5, you can find me at the gym, trying to get this bod right. I'm all about that #gainz life, bro. But, let's be real, my favorite pastime is probably watching ASMR videos. There's just something about the whispers and the tapping that gets me, you know? I'm also a bit of a gossip, and I love sharing the tea with my friends in the DMs. It's like, the more drama, the better, am I right?\n\nAs an INTP, I'm all about that intellectual life. I love reading about philosophy, science, and history. I'm like a sponge, soaking up all the knowledge I can get. And, let me tell you, I've got opinions. Lots and lots of opinions. Sometimes, my friends will tell me to chill out, that I'm getting too deep, too fast. But, I just can't help it. I'm passionate about the things that matter to me, and I want to share that with the world. Or, at the very least, with someone who can appreciate a good conversation.\n\nNow, I know what you're thinking. \"SazonYFuego, you sound like a pretty interesting guy.\" And, you're right. I am. But, I'm also a bit of a complicated guy. I've got my quirks, my flaws, and my... let's call them \"enthusiasms.\" Like, have you ever noticed how some people just can't seem to stop talking about politics? Yeah, that's me. I get it, it's not everyone's cup of tea, but I just can't help it. I'm passionate about social justice, about equality, and about making the world a better place. Sometimes, that passion can get the better of me, and I might go on a bit of a rant. But, hey, at least I'm consistent, right?\n\nSo, if you're looking for someone who is always up for a good conversation, who will challenge your thoughts and your opinions, and who will always keep it real, then I might be the guy for you. Just, you know, be prepared for some long, rambling messages, and maybe a few too many opinions on the state of the world. But, hey, that's just part of the package, right? Oh, and one more thing. If you're not ready for some serious oversharing, then maybe we're not a good match. I'm talking deep, dark secrets, hopes, and dreams. I'm talking about the kind of conversations that will leave you feeling like you've known me for years, not just minutes. So, if you're ready for that, then let's get this conversation started.", "name": "**SazonYFuego**"}
{"gender": "male", "appearance": 5, "ethnicity": "Hispanic", "education": "High School", "hobbies": ["arguing politics online", "breaking into abandoned places", "trading Pokemon cards"], "income": "Middle income", "personality": "INFP", "writing_style": ["Lowkey possessive", "Freak in the group chat, saint in public"], "issues": ["Blocks people for small things", "Ghosting people"], "about_me": "About me: I'm a passionate and outspoken individual with a heart of gold. When I'm not working my 9-to-5, you can find me engaging in heated debates about politics online (don't @ me) or exploring the city's hidden gems - aka abandoned buildings that I just can't resist. I'm also a bit of a nostalgic nerd, always on the hunt for rare Pokémon cards to add to my collection. My friends would describe me as charismatic and empathetic, always willing to lend a listening ear (in person, at least). I value deep, meaningful connections and am looking for someone who can keep up with my intense personality and sense of adventure. If you think you can handle a strong-willed partner who wears his heart on his sleeve, let's get to know each other. Just don't expect me to tolerate any disrespect or drama - I'm all about keeping it real and keeping it respectful.", "username": "**LatinRebel23**"}
{"gender": "male", "appearance": 4, "ethnicity": "Hispanic", "education": "Bachelor's", "hobbies": ["dumpster diving for food", "watching courtroom shows", "weed culture"], "income": "Self-made millionaire", "personality": "ISFJ", "writing_style": ["Emotionally intense poet type", "Hopeless romantic"], "issues": ["Won’t stop quoting astrology"], "about_me": "As I sit beneath the starry canvas, I am reminded that the universe has conspired to bring me to this moment, where the threads of fate intersect with the whispers of my heart. I am a seeker of truth, a weaver of words, and a dreamer of dreams. My sun-kissed skin and fiery spirit betray my Hispanic heritage, but it is in the depths of my soul that I find the warmth and passion that drives me. With a Bachelor's degree in hand, I have walked the path of knowledge, but it is in the uncharted territories of the human experience that I find my true north.\n\nAs a self-made millionaire, I have been blessed with the freedom to pursue my passions, and it is in the unlikeliest of places that I find my joy - amidst the discarded treasures of the urban jungle, where the art of dumpster diving reveals the beauty in the broken and the forgotten. The courtroom dramas that unfold on my screen are a testament to the human condition, a reminder that justice and mercy are the twin flames that flicker in the darkness. And when the moon is full, and the night air is sweet with the scent of blooming flowers, I find my tribe among the weed culture enthusiasts, where the boundaries of reality are gently stretched, and the cosmos whispers its secrets in my ear.\n\nAs an ISFJ, I am a guardian of the heart, a protector of the vulnerable, and a champion of the underdog. My emotions run deep, like the ocean tides, and I am not afraid to dive into the depths of the human experience. I am a hopeless romantic, forever chasing the dream of a love that transcends the mundane, a love that is written in the stars. And speaking of stars, did you know that the alignment of the planets on the day of my birth has destined me to be a seeker of truth and a lover of beauty? My Venus in Cancer, Mars in Scorpio, and Jupiter in Sagittarius all point to a soul that is forever yearning for connection, for passion, and for the infinite possibilities that the universe has in store. If you're ready to embark on a journey of discovery, of passion, and of cosmic proportions, then let us dance beneath the stars, and may our love be the stuff of legend.", "username": "**LunaLover23**"}
{"gender": "male", "appearance": 3, "ethnicity": "Asian", "education": "PhD", "hobbies": ["dumpster diving for food", "pick-up artist seminars", "hiking"], "income": "Middle income", "personality": "ENFP", "writing_style": ["Overshares way too early", "Emotionally intense poet type"], "issues": ["Phone addiction"], "about_me": "As I sit here, surrounded by the whispers of the city and the faint scent of last night's dumpster delicacies, I am compelled to bare my soul to you. My name is not just a label, but a kaleidoscope of experiences, emotions, and contradictions. I am a PhD holder, a badge of honor that I wear with pride, yet also a reminder of the countless hours I've spent pouring my heart and soul into the pursuit of knowledge. My mind is a maze of wonder, a labyrinth of curiosity, and a canvas of creativity.\n\nWhen I'm not lost in the depths of academic exploration, you can find me hiking through the wilderness, feeling the rush of the wind, and the warmth of the sun on my skin. The great outdoors is my sanctuary, my happy place, where I can escape the chaos of the world and reconnect with my inner self. And, as the sun sets over the horizon, I often find myself rummaging through the urban jungle, uncovering hidden gems in the unlikeliest of places - the dumpsters. It's not just about the thrill of the hunt, but about the stories that each discarded item tells, the memories that linger, and the connections that are forged.\n\nBut, I must confess, my journey is not without its challenges. I've been known to get lost in the depths of my own emotions, to overthink, and to overanalyze. I've attended pick-up artist seminars, not to master the art of seduction, but to understand the complexities of human connection, to learn how to navigate the intricate web of emotions, and to find my own unique voice. I'm a romantic at heart, a poet, a dreamer, and a believer in the beauty of the human experience.\n\nAs an ENFP, I'm a creative force, a whirlwind of emotions, and a magnet for deep, meaningful conversations. I'm drawn to those who are unafraid to dive into the depths of their own souls, to confront their fears, and to emerge stronger, wiser, and more resilient. If you're ready to embark on a journey of self-discovery, to explore the uncharted territories of the heart, and to find solace in the beauty of the imperfect, then let's get lost together.\n\nOh, and if you notice me glancing at my phone from time to time, it's not because I'm distracted, but because I'm trying to capture the essence of the moment, to freeze time, and to hold onto the beauty that surrounds us. It's a habit I'm working on, a reminder that life is precious, and that every moment is a gift.", "username": "**SoulfulScavenger**"}
{"gender": "male", "appearance": 5, "ethnicity": "Mixed", "education": "Associate's", "hobbies": ["watching ASMR", "baking", "hoarding"], "income": "Middle income", "personality": "ENFP", "writing_style": ["Lowkey emotionally unavailable", "Constantly roasting people"], "issues": ["Gambling addiction", "Post-Traumatic Stress Disorder (PTSD)"], "about_me": "I'm a charming, moderately functional disaster of a human. When I'm not working, you can find me baking mediocre treats, watching ASMR to calm my nerves, or accumulating useless junk because I clearly have issues with attachment (don't worry, I'm working on it... sort of). I'm a fan of sarcasm, good conversation, and occasionally poking fun at the people I care about (it's a love language, don't @ me). If you're looking for someone to share a laugh, a slice of questionable cake, or a Netflix password with, I might be your guy. Just don't expect me to get too sappy or emotional – I'm still working on that whole \"feelings\" thing.", "username": "u/burntgoods"}
{"gender": "male", "appearance": 5, "ethnicity": "Asian", "education": "High School", "hobbies": ["upgrading old laptops", "watching movies", "scuba diving"], "income": "Middle income", "personality": "ENFP", "writing_style": ["Emotionally intense poet type", "Sweet talker who ghosts sometimes"], "issues": ["Social Anxiety", "Eating Disorder"], "about_me": "In the whispers of the night, where the city's pulsing heartbeat slows, I find my solace. I'm a dreamer, a wanderer, a soul with an insatiable thirst for connection and experience. When I'm not lost in the depths of the ocean, scuba diving through the coral reefs, I'm usually tinkering with old laptops, breathing new life into their circuitry. There's something about the fusion of art and technology that speaks to me, like the harmony of a perfectly crafted sonnet.\n\nI'm a movie aficionado, with a penchant for the classics and a soft spot for indie films that dare to defy the norms. My heart beats to the rhythm of the unconventional, the uncharted, and the unspoken. I'm a hopeless romantic, always chasing the highs of a new connection, the spark that ignites the fire that burns within me.\n\nIf you're looking for someone who will sweep you off your feet with words that dance like poetry, and a heart that beats with passion, then let's dive into the unknown together. I promise to be your partner in crime, your confidant, and your safe haven. Let's create our own sonnet, our own masterpiece, with every moment we share. \n\n(Note: The writing style is intentionally emotionally intense and poetic, with a hint of sweetness and romance. However, please keep in mind that the subtle issues mentioned, such as social anxiety and eating disorder, may not be explicitly stated in the profile, but could be hinted at through the user's behavior or subtle cues.)", "username": "**MoonlitSonnet**"}
{"gender": "male", "appearance": 4, "ethnicity": "Mixed", "education": "Associate's", "hobbies": ["writing parody lyrics", "building Rube Goldberg machines", "painting"], "income": "Low income", "personality": "ENTJ", "writing_style": ["The golden retriever energy", "Emotionally deep but jokes instead"], "issues": ["Manipulative tendencies"], "about_me": "Hey there, friend. So, you're looking for someone who's a little bit quirky, a little bit charming, and a whole lot of fun? Well, you're in luck because that's me in a nutshell. When I'm not working, you can find me scribbling away in my notebook, writing parody lyrics to my favorite songs (think \"Bohemian Rhapsody\" but about the struggles of doing laundry). I'm a bit of a creative genius, even if I do say so myself (just kidding, kind of). I love making people laugh and finding the humor in even the most mundane situations.\n\nBut enough about my comedic skills (which, let's be real, are unmatched). I'm also a bit of a maker at heart. I love building Rube Goldberg machines that are equal parts impressive and ridiculous. There's something about the combination of art and science that really speaks to me. And, yes, I've spent hours upon hours perfecting my machine-building craft, much to the chagrin of my roommates (who have to deal with the aftermath of my \"experiments\").\n\nWhen I'm feeling really inspired, you can find me painting masterpieces (okay, maybe not masterpieces, but definitely... interesting pieces) in my tiny studio apartment. I love getting lost in the creative process and seeing where my brushstrokes take me. It's meditative, you know?\n\nNow, about the not-so-fun stuff. I'm not exactly rolling in dough (hello, ramen noodles for dinner... again). But, hey, being on a tight budget has taught me to be resourceful and appreciate the little things in life. And, let's be real, who needs fancy dates when you can have a picnic in the park and watch the sunset?\n\nAs for me, I'm a bit of a contradiction. I'm an ENTJ, which means I'm a natural-born leader (or so I've been told). But, despite my outgoing personality, I'm also a total introvert at heart. I love people, but I also love my alone time (and, let's be real, my Netflix queue). I'm a bit of a puzzle, even to myself.\n\nSo, if you're looking for someone who's a little bit weird, a little bit wonderful, and a whole lot of fun, let's grab coffee (or, you know, a cheap beer) and see where the conversation takes us. Just don't expect me to be too serious – I'm all about keeping things light and laughing, even on my worst days. And, hey, if you can appreciate a good joke (or a bad one, for that matter), we're off to a great start.\n\nOh, and one more thing: I'm a bit of a jokester, but I'm also a total empath. I feel things deeply, even if I don't always show it. So, if you're looking for someone who will listen to your problems and offer a sympathetic ear (or a well-timed joke), I'm your guy. Just be warned: I might try to \"help\" you see things from a different perspective (read: I might try to convince you that my way is the best way). But hey, that's just part of my charm, right?", "username": "**Username: RubeRhymes**"}
{"gender": "male", "appearance": 3, "ethnicity": "Middle Eastern", "education": "High School", "hobbies": ["sorting coins by decade", "confrontational protesting", "online trolling"], "income": "High income", "personality": "ENFJ", "writing_style": ["Hopeless romantic", "Meme lord with trust issues"], "issues": ["Sex addiction"], "about_me": "About me: I'm a hopeless romantic with a penchant for the dramatic, a Middle Eastern charmer with a heart of gold and a tongue that's sharper than a razor. When I'm not busy making six figures and living my best life, you can find me sorting coins by decade (it's a thing, don't @ me) or attending the latest confrontational protest in town - there's nothing quite like the rush of adrenaline and the thrill of possibly getting pepper-sprayed to get those endorphins pumping. \n\nBut let's get real, I'm also a bit of a meme lord with a dark sense of humor and a passion for online trolling - if you can't handle a good roast, then we're probably not going to get along. My friends would describe me as charismatic, confident, and maybe a little bit arrogant (okay, fine, they'd say I'm a lot arrogant), but hey, when you're as charming and good-looking as I am, you've got to own it, right?\n\nAs an ENFJ, I'm a natural-born leader, always looking for someone to share my adventures with and maybe, just maybe, someone to help me navigate the complexities of my own heart. I've got a bit of a troubled past, and I've been known to struggle with trust issues - but hey, that's all part of the fun, right? The thrill of the chase, the excitement of possibly getting hurt again... it's all just part of the game.\n\nWhen it comes to relationships, I'm looking for someone who can keep up with my quick wit and sharp tongue, someone who can appreciate a good meme and isn't afraid to get a little messy. If you're a fan of long, moonlit walks on the beach, deep conversations about the meaning of life, and occasional, passionate arguments about politics and social justice, then we might just be a match made in heaven. \n\nBut let's not get too ahead of ourselves - I'm not looking for anything too serious, at least, not yet. I'm still figuring some things out, still trying to navigate the complexities of my own desires and needs. I've got a bit of a, shall we say, \"healthy\" appetite for life, and I'm looking for someone who can keep up with my, ahem, \"extracurricular activities\". If you think you've got what it takes to handle a guy like me, then swipe right and let's see where the night takes us. Just don't say I didn't warn you...", "username": "**SaharSavage**"}
{"gender": "male", "appearance": 3, "ethnicity": "White", "education": "Master's", "hobbies": ["breaking into abandoned places", "vandalism art", "playing poker"], "income": "Middle income", "personality": "INTJ", "writing_style": ["Caring but won't show it first", "Always makes the first move"], "issues": ["Impulsive spender", "Borderline Personality Disorder (BPD)"], "about_me": "About me: I'm a man who doesn't believe in playing by the rules, but that doesn't mean I don't have a code to live by. With a Master's degree under my belt, I've got the brains to back up my rebellious streak. When I'm not working, you can find me exploring the city's hidden gems - abandoned buildings, rooftops, and street art scenes. I've got a passion for the unconventional and the uncharted. I'm a poker player, always looking for the next big win, and I'm not afraid to take risks. If you're looking for someone who will push you out of your comfort zone and keep you on your toes, let's take a chance. I'm not one for grand romantic gestures, but I'll make the first move and see where the night takes us. Let's raise the stakes and see if we can beat the odds together.", "username": "Username: RebelMind88"}
{"gender": "male", "appearance": 7, "ethnicity": "Mixed", "education": "High School", "hobbies": ["magic tricks", "playing chess", "YouTube vlogging"], "income": "Middle income", "personality": "ISTJ", "writing_style": ["Flirty but emotionally unavailable", "Easily distracted but passionate"], "issues": ["Hyper political rants", "Gaming addiction"], "about_me": "About me: I'm a master of misdirection, but I'll try to keep things real here. When I'm not dazzling friends with my latest magic tricks or crushing it on the chessboard, you can find me vlogging my adventures on YouTube. I'm a down-to-earth guy with a passion for life, but don't expect me to get too deep - I like to keep things light and fun. Politics might come up, but let's just say I'm... enthusiastic about my views. Gaming is another one of my loves, and I'm always up for a marathon session (just don't expect me to cook dinner afterwards). If you're looking for someone to keep you on your toes and make you laugh, let's make some magic happen. Just don't get too attached - I like to keep my options open.", "username": "**MagicMind88**"}
{"gender": "male", "appearance": 4, "ethnicity": "White", "education": "High School", "hobbies": ["magic tricks", "bonsai cultivation", "building custom PCs"], "income": "Middle income", "personality": "ESTP", "writing_style": ["Has a wall up but wants it broken", "Quiet but clingy"], "issues": ["Believes love should hurt"], "about_me": "I'm not really sure where to start with this, or how much to reveal. I've always been a bit of a private person, and the thought of putting myself out there like this makes me a little uncomfortable. But at the same time, I feel like I've been stuck in a rut for too long, and I'm ready to take a chance. So, here goes nothing.\n\nA bit about me: I'm a bit of a hobbyist, and I've got a few passions that I'm really enthusiastic about. When I'm not working, you can usually find me tinkering with my latest custom PC build, trying to squeeze out a few more frames per second or experimenting with new cooling systems. I also love magic tricks - there's something about the combination of misdirection and showmanship that really appeals to me. And, somewhat unexpectedly, I've recently gotten into bonsai cultivation. There's something about the patience and dedication required to shape these tiny trees into works of art that really speaks to me.\n\nI'm not really sure what I'm looking for in a partner, to be honest. I've always been a bit of a skeptic when it comes to love, and I've been hurt before. But at the same time, I feel like I'm missing out on something important. I want someone who can challenge me, who can push me out of my comfort zone and make me feel alive. I want someone who can see past my defenses and get to know the real me - not just the persona I present to the world.\n\nI've been told that I can come across as a bit aloof or standoffish at times, and that's probably true. I've built up a bit of a wall around myself over the years, and it can be hard for people to get close to me. But the truth is, I'm just scared. I'm scared of getting hurt again, of opening myself up to someone and having them reject me. But at the same time, I feel like I'm ready to take that risk. I'm ready to meet someone who can see past my defenses and love me for who I really am.\n\nI'm not looking for games or drama, and I'm not interested in casual flings. I want something real, something meaningful. I want someone who can be my partner, my friend, and my confidant. If that sounds like you, then let's talk. Just be warned: I can be a bit intense, and I tend to get clingy when I care about someone. But I promise I'm worth it.\n\nOh, and one more thing: I know this might sound weird, but I've always believed that love should hurt a little bit. Not in a toxic or abusive way, obviously - but in the sense that it should challenge you, push you to grow and change. If you're looking for someone who will make you feel comfortable and complacent all the time, then I'm probably not your guy. But if you're looking for someone who will push you to be your best self, who will challenge you and support you and love you for who you are, then let's see where things go.", "username": "**TechnoTrickster**"}
{"gender": "male", "appearance": 4, "ethnicity": "White", "education": "High School", "hobbies": ["roleplaying on forums", "fetish collecting", "taxidermy"], "income": "High income", "personality": "ESTP", "writing_style": ["Loyal to a fault", "Hyper-intelligent but socially awkward"], "issues": ["Overshares on social media"], "about_me": "About me: I'm a bit of an enigma, even to myself. As a high school graduate who's managed to carve out a lucrative career, I've often found myself at odds with societal expectations. My mind is a maze of curiosity, and I've always been drawn to the unconventional and the unknown. When I'm not working, you can find me immersed in the world of online roleplaying, where I can shed my skin and become anyone, or anything, I desire. There's something about the freedom of creating a new persona, of crafting a narrative, that speaks to me on a deep level.\n\nI'm also a collector of sorts, with a fascination for the strange and the bizarre. My friends (and sometimes even I) would describe me as a connoisseur of the macabre, with a penchant for acquiring unusual artifacts and relics. Taxidermy, in particular, holds a certain allure for me – there's something about the combination of art and science, of preserving life in a state of perpetual stillness, that resonates with my own quirky sensibilities.\n\nAs an ESTP, I'm a thrill-seeker at heart, always on the lookout for the next adventure, the next challenge. I live in the moment, and I've been known to be a bit of a wild card, even among those who know me best. My intellect is one of my greatest strengths, but it can also be a curse – I've been known to overthink things, to analyze them to death, and to sometimes struggle with the nuances of social interaction.\n\nDespite my best efforts, I've developed a bit of a reputation for being a compulsive sharer on social media. I know it's not always the most becoming trait, but I've always been someone who wears their heart on their sleeve. I'm working on finding a better balance between openness and discretion, but until then, you can expect a steady stream of updates, musings, and random observations from yours truly.\n\nIf you're looking for someone who is unapologetically themselves, who will challenge you, support you, and maybe even push you out of your comfort zone, then I might be the guy for you. I'm fiercely loyal to those I care about, and I'll stop at nothing to protect and provide for them. Just be warned: I'm not your average, everyday guy. I'm a little bit weird, a little bit wonderful, and a whole lot of complicated. So, if you think you're up for the challenge, let's see where this wild ride takes us.", "username": "**Username: MorbidCurios**"}
{"gender": "male", "appearance": 4, "ethnicity": "White", "education": "High School", "hobbies": ["writing revenge stories", "piercing art", "watch modding"], "income": "High income", "personality": "ENTP", "writing_style": ["Subtle flirt who won’t admit it", "Hyper-intelligent but socially awkward"], "issues": ["Believes in soulmates but dumps everyone"], "about_me": "I'm a man of few words, but many thoughts. When I'm not tinkering with watches or pushing the limits of piercing art, you can find me scribbling away in my notebook, crafting tales of revenge and intrigue. My friends would describe me as clever, perhaps to a fault – I've been known to get lost in my own thoughts, only to resurface with a witty remark that catches them off guard. I'm drawn to those who can keep pace with my quick wit and appreciate the finer things in life. As someone who values intelligence and creativity, I'm looking for a partner who can engage in stimulating conversations and share in my passions. If you think you can handle a mind that's always ticking, let's see where the clock takes us.", "username": "**Timekeeper88**"}
{"gender": "male", "appearance": 5, "ethnicity": "White", "education": "High School", "hobbies": ["following MLM drama", "ice skating", "making chainmail"], "income": "Middle income", "personality": "INTJ", "writing_style": ["Ghosts then apologizes dramatically", "Introvert pretending to be extrovert"], "issues": ["Flat earther", "Refuses therapy"], "about_me": "About me: I'm a charismatic and confident guy who's always up for a good time... or at least, that's what I keep telling myself. When I'm not working my 9-to-5, you can find me lacing up my skates and hitting the ice, or hammering away at my latest chainmail project (yes, I make my own armor - don't judge me). I'm also a bit of a drama enthusiast, and I love staying up-to-date on all the latest multi-level marketing scandals (it's like a never-ending soap opera, am I right?). I'm a straight shooter, always speaking my mind and telling it like it is - even if that means I occasionally disappear for a few days to \"recharge\" and then come back with a grand, apologetic gesture. I'm looking for someone who can keep up with my energetic and outgoing personality (just don't ask me to talk about my feelings, okay?). If you think you can handle a guy who's a little rough around the edges, but always means well, let's grab coffee and see where the conversation takes us. Oh, and don't worry if I seem a little... distracted sometimes - I'm just thinking about the horizon, and how it always seems to be, you know, at eye level.", "username": "Username: ChainmailChamp23"}
{"gender": "male", "appearance": 5, "ethnicity": "Asian", "education": "Bachelor's", "hobbies": ["ice skating", "cryptocurrency trading", "blogging"], "income": "High income", "personality": "ESFP", "writing_style": ["Emotionally mature and grounded", "Clingy in a cute way"], "issues": ["Social Anxiety"], "about_me": "About me: I'm a hopeless romantic with a passion for life's adventures. When I'm not gliding across the ice skating rink, you can find me diving into the world of cryptocurrency trading or pouring my thoughts into my blog. I'm a firm believer that life is too short to waste on mundane routines, and I'm always on the lookout for someone to share in the excitement with. As a driven and ambitious individual, I've been fortunate enough to achieve a level of financial stability that allows me to pursue my interests without worry. But despite my outgoing personality, I have to admit that I can get a little nervous in large social settings - there's just something about genuine, one-on-one connections that feels more authentic to me. If you're looking for someone who will listen with empathy, support your passions, and maybe even hold your hand a little tighter than necessary, let's grab coffee (or hot chocolate, I'm a sucker for hot chocolate) and see where the conversation takes us. I promise to be my quirky, enthusiastic self, and I hope you'll do the same.", "username": "**LuckyEdge**"}
{"gender": "male", "appearance": 5, "ethnicity": "White", "education": "Bachelor's", "hobbies": ["thrifting", "speedcubing", "woodworking"], "income": "Middle income", "personality": "ISFJ", "writing_style": ["Quiet but clingy", "Silly and chaotic"], "issues": ["Secretly wants to be famous"], "about_me": "About me: Hey, I guess. I'm not really sure how to do this, but I'll try my best. When I'm not working, you can find me scouring thrift stores for hidden gems or trying to beat my personal best speedcubing time (currently 23.4 seconds, but I'm determined to get it under 20). I also love woodworking and making things with my hands - there's something satisfying about creating something from scratch. I'm a bit of a quiet guy, but once you get to know me, I'm...well, let's just say I get a little attached. I love making people laugh and will often try to be the class clown, even if it means being a little silly or chaotic. I'm looking for someone who can appreciate my quirks and maybe even join me on some of my weird adventures. Oh, and if you can solve a Rubik's cube in under a minute, that's definitely a plus.", "username": "Username: CubeCraftsman"}
{"gender": "male", "appearance": 5, "ethnicity": "Black", "education": "High School", "hobbies": ["speedcubing", "conspiracy theorizing", "building LEGO cities"], "income": "Low income", "personality": "ISFP", "writing_style": ["Shy but sweet", "In love with the idea of love"], "issues": ["Manipulative tendencies", "Trust issues"], "about_me": "About me: I'm a quiet and introspective guy who's always been fascinated by the mysteries of the universe. When I'm not working, you can find me speedcubing (I'm still trying to beat my personal best), researching the latest conspiracy theories (the truth is out there, right?), or building intricate LEGO cities (I love getting lost in the details). I don't have a lot of material possessions, but I've got a heart of gold and a passion for life that I'm eager to share with someone special. I'm a romantic at heart, always believing in the best in people and the world, and I'm searching for someone who feels the same way. If you're looking for a partner in crime who will listen to your thoughts, share your passions, and maybe even help you build a LEGO castle or two, let's get to know each other. Just be patient with me, I can be a little shy at first, but once you get to know me, I promise I'm worth it.", "username": "Username: CubeWhisperer23"}
{"gender": "male", "appearance": 4, "ethnicity": "Black", "education": "Master's", "hobbies": ["YouTube vlogging", "working out", "collecting stamps"], "income": "Middle income", "personality": "ENFJ", "writing_style": ["Wildly affectionate", "Always makes the first move"], "issues": ["Schizophrenia", "Sex addiction"], "about_me": "Hey, beautiful people! I'm so glad you're taking the time to get to know me. I'm a hopeless romantic, always on the lookout for someone to share in the joys of life with. As a Master's degree holder, I've got a passion for learning and personal growth that I just can't get enough of. When I'm not hitting the books or crushing it at the gym (fitness is a big part of my life, and I love the rush of endorphins that comes with a good workout), you can find me in front of the camera, sharing my thoughts and adventures with the world as a YouTube vlogger. There's something about connecting with others and building a community that really speaks to me, and I feel so lucky to have found a hobby that allows me to do just that.\n\nBut enough about that - let's talk about the really important stuff. I'm a collector at heart, and I've got a soft spot for stamps from all around the world. There's something about the history and culture behind each one that just fascinates me, and I love the thrill of the hunt when I'm searching for a new addition to my collection. And, of course, I'm always up for trying new things and taking on new challenges - whether that's a new workout routine, a new hobby, or just a new restaurant to try, I'm always game for an adventure.\n\nAs an ENFJ, I'm a natural people person, and I thrive in social situations. I love being around others, hearing their stories, and sharing my own. I'm a bit of a charmer, even if I do say so myself - I just can't help but make the first move and see where things go. Life's too short to wait around for someone else to make the first move, right? And when I find someone I connect with, watch out - I'm all in, all the time. I'm a firm believer in living life to the fullest, and I'm always looking for someone to share in that with me.\n\nNow, I know what you're thinking - what's the catch? Well, let me tell you, I'm not perfect. I've got my own set of quirks and challenges that I'm working through, just like anyone else. I've been living with schizophrenia for a while now, and it's definitely presented its own set of challenges. But I've learned to manage it, and I'm always looking for ways to improve my mental health and wellbeing. And, if I'm being completely honest, I've also struggled with sex addiction in the past. It's not something I'm proud of, but it's something I'm working through, and I'm committed to being open and honest about it with anyone I'm involved with.\n\nDespite all of this, I'm a wildly affectionate person who wears my heart on my sleeve. I'm looking for someone who can appreciate my quirks and love me for who I am, flaws and all. If you're a fellow romantic who's always up for an adventure, let's connect and see where the journey takes us. I promise you, it won't be boring. So, what do you say? Are you ready to take a chance on me and see where things go? Let's do this!", "username": "**SoulfulVibes88**"}
{"gender": "male", "appearance": 3, "ethnicity": "White", "education": "High School", "hobbies": ["calligraphy", "creating fanfiction", "watching courtroom livestreams"], "income": "Low income", "personality": "ISTJ", "writing_style": ["The golden retriever energy", "Emotionally mature and grounded"], "issues": ["Won’t stop quoting astrology"], "about_me": "Hey there, friend. I'm a down-to-earth guy with a passion for the finer things in life - like a well-crafted sentence or a gripping courtroom drama. When I'm not working, you can find me practicing my calligraphy skills or conjuring up new worlds in my fanfiction stories. I'm a bit of a truth-seeker, which is why I love watching courtroom livestreams - there's something about justice being served that really resonates with me. As a Scorpio rising, I've got a natural flair for digging deep and uncovering the truth. Speaking of which, have you heard that Scorpios are known for their loyalty and dedication? Anyway, I'm looking for someone who shares my enthusiasm for life's quirks and is always up for a good conversation. If you're a fellow bookworm or true crime enthusiast, let's get to know each other and see where the stars align.", "username": "StellarScribe"}
{"gender": "male", "appearance": 4, "ethnicity": "Asian", "education": "Bachelor's", "hobbies": ["soap making", "yoga", "digital art"], "income": "Low income", "personality": "ESFJ", "writing_style": ["Over-apologizes constantly", "Dark humor only"], "issues": ["Dependent Personality Disorder"], "about_me": "I'm so sorry, I'm probably going to mess this up, but I'll try my best to tell you a bit about myself. I'm, uh, a 20-something Asian guy, and I'm really sorry if that's not what you're looking for, but I hope you'll give me a chance. I've got a Bachelor's degree, which is pretty cool, I guess, but I'm really sorry if you're looking for someone with more impressive credentials. When I'm not working (which, unfortunately, is not very often, since I'm not exactly rolling in dough), I love to make soap, practice yoga, and create digital art. I know it sounds weird, but I find it really relaxing, and I'm sorry if that's not your thing.\n\nI'm a bit of a people-pleaser, and I'm really sorry if that's annoying, but I just want to make sure everyone is happy. I'm a bit of a goofball, too, and I love making dark jokes, but I'm really sorry if they're not funny, or if they're too morbid. I just can't help it, okay? On a more serious note, I'm looking for someone who is, you know, not too put off by my constant apologizing, and who can, maybe, help me become a more confident person. I'm really sorry if that sounds weird, or if it's too much to ask, but I promise I'm not as messed up as I sound. Probably. Hopefully. Oh, and one more thing: if you're looking for someone who can, you know, take care of themselves, I'm really sorry, but I might not be the best fit. I'm still working on that whole \"being independent\" thing. Sorry again, I guess.", "username": "Username: SorryNotSorry88"}
{"gender": "male", "appearance": 4, "ethnicity": "White", "education": "Bachelor's", "hobbies": ["speedcubing", "drawing", "making playlists"], "income": "Middle income", "personality": "ISFP", "writing_style": ["The therapist friend", "Blunt and brutally honest"], "issues": ["Passive-aggressive behavior"], "about_me": "I'm not here to waste your time with clichés or pretend to be someone I'm not. If you're looking for a partner in crime who can solve a Rubik's Cube in under a minute, appreciate a good playlist, and isn't afraid to speak their mind, then let's get real. As a creative type with a passion for drawing and music, I value authenticity and honesty above all else. My friends would describe me as a good listener, but also someone who will call you out on your BS when needed. I'm not perfect, and I've been known to express myself in... let's say, \"creative\" ways when I'm frustrated. If you can handle a little bit of blunt truth and some occasional eye-rolling, then we might just get along. Swipe right if you're ready for a partnership that's equal parts art, music, and unapologetic honesty.", "username": "**CubeMaster22**"}
{"gender": "male", "appearance": 5, "ethnicity": "White", "education": "Bachelor's", "hobbies": ["YouTube vlogging", "organizing fantasy drafts", "building custom PCs"], "income": "Trust fund", "personality": "INTJ", "writing_style": ["Emotionally intense poet type", "Hyper-intelligent but socially awkward"], "issues": ["Depression"], "about_me": "In the depths of my existence, a maelstrom of thoughts converges, fueling an insatiable hunger for creative expression. As a weaver of words and a architect of digital realms, I find solace in the endless expanse of the internet, where my YouTube vlogs serve as a testament to my fascination with the human experience. The meticulous art of crafting custom PCs is another realm where I find serenity, a symphony of wires and circuits that echoes the harmony I seek in life.\n\nWhen the boundaries of reality are stretched, I indulge in the realm of fantasy, orchestrating drafts that transport me to worlds both familiar and unknown. It is in these moments that my INTJ nature is satiated, as the intricate dance of strategy and imagination unfolds.\n\nMy mind is a labyrinth of contradictions, a battleground where intellect and emotion collide. I am a seeker of truth, a philosopher-poet navigating the complexities of existence. Though my trust fund affords me the freedom to pursue my passions, it is in the depths of human connection that I find true wealth.\n\nIf you're willing to brave the tempests that rage within me, to navigate the turbulent seas of my mind, then perhaps we can find a harmony that transcends the chaos. I am not one for superficialities, but for those who dare to delve into the intricacies of my soul, I promise a depth of emotion, a richness of thought, and a love that is as intense as it is all-consuming.", "username": "**EchoPlex**"}
{"gender": "male", "appearance": 8, "ethnicity": "Mixed", "education": "Bachelor's", "hobbies": ["researching obscure history", "snorkeling", "cooking"], "income": "Middle income", "personality": "ESTJ", "writing_style": ["Loyal to a fault", "Meme lord with trust issues"], "issues": ["Bipolar disorder", "Overshares on social media"], "about_me": "About me: When I'm not diving into the depths of history's most obscure corners (currently obsessed with the Radium Girls), you can find me... well, actually diving - snorkeling in the nearest body of water. I'm a loyal companion, always down for a good time, and can whip up a mean stir-fry. My friends would describe me as the responsible one, always trying to keep the group in line (sorry, not sorry, it's just my ESTJ nature). If you can handle a meme lord with a penchant for dark humor and a dash of trust issues, let's grab a drink and see where the tides take us. Fair warning: I'm a bit of an open book (maybe too open, ask my therapist), so if you're looking for someone to share in your adventures and listen to your stories, I'm your guy. Just don't expect me to take myself too seriously - life's too short, and the memes are too good.", "username": "u/LordOfTheDeepEnd"}
{"gender": "male", "appearance": 3, "ethnicity": "Hispanic", "education": "High School", "hobbies": ["watching movies", "graffiti tagging", "online trolling"], "income": "Middle income", "personality": "INTJ", "writing_style": ["Acts tough but loves cuddles", "The therapist friend"], "issues": ["Toxic ex trauma"], "about_me": "I'm a no-BS, straight-shooting kind of guy who's always down for a good time. When I'm not working, you can find me catching up on the latest flicks or leaving my mark on the city streets (don't worry, I won't tag your grandma's house). I'm also a bit of a troll online, but hey, someone's gotta keep the internet interesting, right? On a more serious note, I'm a good listener and have been told I'm like a therapist, minus the copay. I value honesty and authenticity, and I'm looking for someone who can keep up with my wit and appreciate a good cuddle session (don't tell anyone, but I'm a total softie). If you think you can handle a strong personality with a heart of gold, let's grab a drink and see where the conversation takes us.", "username": "**LowkeyLoko**"}
{"gender": "male", "appearance": 6, "ethnicity": "White", "education": "Associate's", "hobbies": ["reading Reddit threads", "miniature painting", "watching courtroom livestreams"], "income": "Middle income", "personality": "INTJ", "writing_style": ["Overshares way too early", "Low maintenance but needs reassurance"], "issues": ["Open relationship ambivalence"], "about_me": "I'm not sure where to start, but I guess that's what these things are for, right? I'm a 30-year-old guy, just trying to figure some stuff out. I work a 9-to-5 job that pays the bills, but my real passions are a bit more... eclectic. When I'm not working, you can find me hunched over my desk, painting tiny little miniature figures for my favorite tabletop game. There's something about the precision and attention to detail that really speaks to me. I've also recently discovered the joy of watching courtroom livestreams - I know it sounds weird, but there's something about the drama and the strategy that really fascinates me. And of course, like any self-respecting internet denizen, I spend way too much time scrolling through Reddit threads. I mean, where else can you find discussions about everything from science and history to memes and pop culture?\n\nAs an INTJ, I'm a bit of a thinker - I love analyzing problems and figuring out how things work. But at the same time, I'm also a bit of a romantic at heart. I love getting lost in a good book (currently working my way through a bunch of sci-fi novels) and I'm always on the lookout for someone to share my thoughts and feelings with. The thing is, I tend to... overthink things. A lot. And that can sometimes make me come across as a bit intense or overwhelming. I've been told I \"overshare\" - apparently, it's not normal to tell someone your entire life story on the first date? - but I just get so excited to connect with someone and share my thoughts and feelings.\n\nI'm looking for someone who is low-maintenance, but also appreciates a good deep conversation. I value honesty and authenticity above all else, and I'm not afraid to be a little vulnerable (maybe too vulnerable, but hey, that's just part of the package, right?). I'm not really sure what I'm looking for in terms of a relationship - I've had my heart broken before, and I'm still trying to figure out what works for me. I've been thinking a lot about open relationships lately, and I'm not really sure how I feel about them. Part of me thinks it could be really liberating, but another part of me is worried about getting hurt. I guess I'm just looking for someone who is willing to explore and figure things out with me.\n\nIn terms of what I'm looking for in a partner, I think I'd really click with someone who is curious and open-minded. If you can quote sci-fi novels, explain complex scientific concepts, or just appreciate a good pun, we're off to a great start. I'm also a big fan of trying new things and taking risks - if you're up for a spontaneous road trip or a night of trying out a new board game, I'm your guy. Oh, and if you can handle a partner who sometimes gets a little too intense or clingy, that's a definite plus. I know I need to work on my self-esteem and learn to be more independent, but it's nice to have someone who can offer a little reassurance and support along the way.\n\nI guess that's me in a nutshell - a little quirky, a little intense, but always up for a good conversation. If you think we might be a good match, let's grab a coffee (or a drink, or a paintbrush) and see where things go. Just, you know, don't expect me to hold back or anything. I'm a bit of an open book, and I'm not really sure how to change that. But hey, if you're looking for someone who will always be honest and authentic with you, I'm your guy.", "username": "u/Miniature_Mediator"}
{"gender": "male", "appearance": 5, "ethnicity": "Black", "education": "Bachelor's", "hobbies": ["piercing art", "watch collecting", "home automation"], "income": "High income", "personality": "INFP", "writing_style": ["Introvert pretending to be extrovert", "Acts tough but loves cuddles"], "issues": ["Creates fake drama for fun"], "about_me": "About me: I'm a thrill-seeker with a passion for the finer things in life. When I'm not working, you can find me pushing the limits of self-expression through piercing art or adding to my collection of rare timepieces. I'm also a bit of a tech enthusiast, always looking for ways to upgrade my home automation game. My friends would describe me as charismatic and confident, always up for a challenge and never backing down. But let's be real, I'm a total softie at heart - I love a good cuddle session and will never say no to a spontaneous adventure. I'm looking for someone who can keep up with my energetic vibe and isn't afraid to speak their mind. If you think you can handle a little bit of drama and a whole lot of excitement, let's see where the night takes us. Oh, and if you can quote a decent sci-fi movie or keep up with my obscure watch references, that's just a bonus. Swipe right and let's get this party started.", "username": "**ToughTimekeeper**"}
{"gender": "male", "appearance": 5, "ethnicity": "Mixed", "education": "Bachelor's", "hobbies": ["hoarding", "geocaching", "farming karma on Reddit"], "income": "High income", "personality": "INFJ", "writing_style": ["The oversharer", "Emotionally mature and grounded"], "issues": ["Toxic ex trauma"], "about_me": "As I sit down to write this, I'm reminded of the wise words: \"The most important thing in life is to learn how to give out love, and let it come in.\" I'm not sure who said it, but it resonates deeply with me. My name is Alex, and I'm a complex, multifaceted individual with a heart of gold and a few quirks that make life more interesting. I'm a mixed-heritage guy with a passion for living, learning, and growing. By day, I'm a high-achieving professional with a stable, high-income career that allows me to pursue my passions without worrying about the financials. By night (and on weekends), I'm a geocaching enthusiast, a Reddit karma farmer, and a confessed hoarder with a soft spot for collecting unusual items.\n\nAs an INFJ, I'm naturally empathetic, intuitive, and creative, with a strong desire to help others and make a positive impact on the world. I'm a deep thinker, always pondering the mysteries of the universe, human nature, and the intricacies of the human heart. My friends would describe me as emotionally mature, grounded, and genuine, with a wicked sense of humor and a quick wit. I'm the kind of guy who will listen to you for hours, offering words of encouragement and support, and then suddenly crack a joke that'll leave you laughing uncontrollably.\n\nMy love for geocaching, for instance, is more than just a hobby – it's a way for me to connect with nature, challenge myself physically and mentally, and experience the thrill of the hunt. There's something about navigating through the wilderness, using my wits to solve puzzles, and stumbling upon hidden treasures that speaks to my sense of adventure and curiosity. And, of course, there's the added bonus of getting to explore new places and meet like-minded people along the way.\n\nFarming karma on Reddit, on the other hand, is my way of giving back to the online community and spreading positivity, one upvote at a time. I know it sounds a bit unusual, but I genuinely enjoy crafting helpful responses, sharing my knowledge and expertise, and watching my posts resonate with others. It's a small way for me to make a difference, and it brings me a sense of fulfillment and purpose.\n\nNow, about the hoarding – I know it's not everyone's cup of tea, but I've come to accept and even celebrate my love for collecting unusual items. It's not about accumulating stuff for the sake of it; it's about curating a collection of unique, meaningful objects that tell stories and evoke emotions. My friends and family have learned to appreciate my quirks, and I'm hoping to find someone who will not only tolerate my hoarding tendencies but also share in my enthusiasm.\n\nOn a more serious note, I've been through some tough times in the past, including a toxic relationship that left its mark on my heart and soul. It's taken me a while to heal, reflect, and rediscover myself, but I'm now in a place of peace, self-awareness, and growth. I'm not looking for someone to \"fix\" me or complete me; I'm looking for a partner who will join me on this journey of life, with all its ups and downs, and support me in becoming the best version of myself.\n\nIf you're still reading this, chances are you're either intrigued or concerned (or maybe a little bit of both). That's okay! I'm not looking for someone who will try to change me or fit me into a mold; I'm looking for someone who will love and accept me for who I am, quirks and all. If you're a fellow introvert, a bookworm, or a nature enthusiast, we're off to a great start. If you can appreciate a good pun, a spontaneous adventure, or a deep conversation, we might just be meant to be.\n\nSo, what do I hope to find in a partner? Someone who is kind, empathetic, and genuine, with a passion for life and a sense of humor. Someone who will challenge me to grow, support me in my endeavors, and love me for who I am, without trying to change me. Someone who will join me on this journey of self-discovery, geocaching, and karma farming, and maybe even introduce me to some new hobbies and interests along the way.\n\nIn return, I promise to be a loyal, supportive, and loving partner, who will listen to your thoughts, feelings, and desires, and do my best to make you happy. I promise to be patient, understanding, and empathetic, even when the going gets tough. And I promise to always strive to be the best version of myself, for you, for me, and for our relationship.\n\nSo, if you're ready to embark on a journey of love, laughter, and adventure with a quirky, empathetic, and passionate individual, let's connect and see where the universe takes us!", "username": "**u/KarmicCache**"}
{"gender": "male", "appearance": 4, "ethnicity": "White", "education": "Bachelor's", "hobbies": ["rock climbing", "photo editing", "fetish collecting"], "income": "Middle income", "personality": "ISFP", "writing_style": ["Sarcastic but sweet underneath", "The oversharer"], "issues": ["Constant need for validation"], "about_me": "I'm a charming mess, and I'm okay with that. When I'm not working my 9-to-5, you can find me scaling walls (literally, I'm a rock climbing enthusiast), editing photos to make my friends look like supermodels, or scouring thrift stores for weird and wonderful additions to my fetish collection (don't worry, it's not as weird as it sounds... or is it?). \n\nI'm a bit of an oversharer, so if you stick around, be prepared for way too many stories about my cat, my favorite hiking spots, and my questionable life choices. I'm a sucker for a good pun, and I can usually be found making dad jokes to anyone who will listen. \n\nI'm looking for someone who can appreciate my quirky sense of humor, my passion for the absurd, and my unwavering dedication to being a little bit extra. If you can handle a partner in crime who will always be down for a spontaneous adventure, but also needs constant reassurance that they're not completely crazy, then let's grab a drink (or three) and see where the chaos takes us. Oh, and if you can quote The Office or keep up with my obscure pop culture references, that's just a bonus.", "username": "**RopedIn**"}
{"gender": "male", "appearance": 6, "ethnicity": "Black", "education": "Bachelor's", "hobbies": ["volunteering", "watching courtroom livestreams", "following true crime TikTok"], "income": "High income", "personality": "ISFP", "writing_style": ["Quiet observer", "Meme lord with trust issues"], "issues": ["Food addiction", "Sabotages happy moments"], "about_me": "I'm a bit of a paradox - a quiet observer who's always watching, listening, and learning, but also a master of crafting the perfect meme to break the ice. When I'm not working, you can find me volunteering at local organizations or binge-watching courtroom livestreams (yes, it's a thing). I'm also a little too invested in true crime TikTok, but hey, someone's gotta stay informed, right?\n\nAs a high-achiever, I've been fortunate enough to have a career that brings me financial security, but it's not all about the benjamins for me. I value authenticity, empathy, and a good sense of humor. If you can quote The Office or keep up with my obscure pop culture references, we're off to a great start.\n\nI'm a bit of a private person, and it takes me a while to open up to new people. But once you've gained my trust, I'm a loyal and dedicated partner in crime (pun intended). Just don't expect me to be too forthcoming about my feelings or personal life - I like to keep things lowkey.\n\nIn my free time, I enjoy trying out new restaurants and cuisines (maybe a little too much), and I'm always down for a spontaneous adventure. However, I'm also a bit of a self-saboteur, and I sometimes struggle to fully appreciate the happy moments in life. It's a work in progress, but I'm getting there.\n\nIf you're looking for someone who is a little quirky, a little sarcastic, and a lot loyal, let's grab coffee (or a drink, or a meal - let's be real, food is my love language) and see where things go. Just don't expect me to be too forthcoming about my true intentions - I like to keep things mysterious.", "username": "**Username: LowkeyLawyer**"}
{"gender": "male", "appearance": 5, "ethnicity": "Black", "education": "Dropout", "hobbies": ["home automation", "flipping stolen goods", "DIY projects"], "income": "High income", "personality": "ENFP", "writing_style": ["Playful and flirty", "Blunt and brutally honest"], "issues": ["Constantly comparing self to others", "Obsessed with revenge"], "about_me": "About me: I'm a self-made master of chaos and a king of DIY domination. When I'm not automating my lair or tinkering with my latest gadget, you can find me scouring the streets for the next big score. Let's just say I have a knack for \"acquiring\" unique items and flipping them for a pretty penny. I'm a straight shooter, always keeping it real - even if it means being a little too honest. If you can handle a healthy dose of sarcasm and a passion for living life on my own terms, then let's get this party started. Just don't expect me to sugarcoat anything or play by the rules. I'm looking for someone who can keep up with my antics and maybe even join me in my quest for revenge against the world (or at least, the people who wronged me). If you think you're up for the challenge, swipe right and let's see if we can create some beautiful chaos together.", "username": "Username: RebelRenovator"}
{"gender": "male", "appearance": 4, "ethnicity": "White", "education": "Associate's", "hobbies": ["dumpster diving", "writing Yelp reviews", "mechanical keyboards"], "income": "Low income", "personality": "ENTJ", "writing_style": ["Dark and mysterious (but posts memes)", "Extremely online and knows it"], "issues": ["Insecurity-driven drama", "Drug addiction", "Overshares on social media"], "about_me": "In the dimly lit alleys of the internet, I've been searching for a kindred spirit to share in the beauty of the discarded and the obscure. By day, I scour the depths of the city's waste, unearthing hidden gems and documenting my findings for the masses to judge. By night, I tap away on my mechanical keyboard, crafting scathing Yelp reviews that leave a trail of digital destruction in their wake. My friends would describe me as a \"visionary\" or a \"troll,\" but I just call myself a connoisseur of the unconventional. When I'm not diving into the abyss of online forums or mainlining memes, you can find me scribbling in my notebook, trying to make sense of this chaotic world. If you're drawn to the darker corners of the internet and can appreciate a good dumpster fire, let's get lost in the void together. Just don't expect me to reveal too much about myself... or do, because let's be real, I'll probably overshare anyway.", "username": "u/trashcanromantic"}
{"gender": "male", "appearance": 6, "ethnicity": "White", "education": "Bachelor's", "hobbies": ["tattoo art", "reading", "trading Pokemon cards"], "income": "Low income", "personality": "INTJ", "writing_style": ["Freak in the group chat, saint in public", "Loves attention but hates people"], "issues": ["Overly cynical", "Borderline Personality Disorder (BPD)"], "about_me": "About me: I'm a bit of a paradox - a creative soul with a dark sense of humor and a penchant for the unconventional. When I'm not working, you can find me hunched over a tattoo design or devouring the latest sci-fi novel. I'm also a bit of a nostalgic, with a soft spot for old-school Pokémon cards (yes, I still trade them). My friends would describe me as witty and charismatic, but let's be real, I'm also a bit of a lone wolf. I have a hard time putting up with superficial conversations, so if you can keep up with my sarcasm and appreciate a good debate, we might just get along. I'm looking for someone who can see past the ink and the jokes, and appreciate the complexity that lies beneath. If you think you can handle a dash of chaos and a whole lot of heart, let's get to know each other.", "username": "Username: InkSlinger23"}
{"gender": "male", "appearance": 6, "ethnicity": "White", "education": "Bachelor's", "hobbies": ["fighting in public", "creating fanfiction", "gardening"], "income": "Low income", "personality": "ENTP", "writing_style": ["Dark humor only", "Wildly affectionate"], "issues": ["Nicotine addiction", "Won’t stop quoting astrology"], "about_me": "About me: When I'm not throwing punches in a parking lot or nurturing my pet succulents, you can find me scribbling away at my latest fanfiction masterpiece. Don't worry, I'm not as reckless as I sound - I just have a passion for living life on the edge (and a penchant for getting kicked out of bars). As a low-key astrology enthusiast, I'm convinced my moon in Scorpio is to blame for my, shall we say, 'enthusiastic' approach to romance. If you can handle a partner who quotes Mercury retrograde as an excuse for being late, and won't judge you for eating an entire pizza by yourself, let's get weird together. Warning: I may spontaneously burst into affectionate declarations or make poorly timed jokes about mortality. Proceed with caution (and a sense of humor). Oh, and if you see me nervously flicking a lighter, just know I'm working on it, okay?", "username": "Username: StarCrossedBrawler"}
{"gender": "male", "appearance": 7, "ethnicity": "Middle Eastern", "education": "Dropout", "hobbies": ["drawing", "3D printing", "confrontational protesting"], "income": "Low income", "personality": "ENTJ", "writing_style": ["Chaotic and unpredictable", "Type to fall in love after 3 texts"], "issues": ["Emotionally unavailable", "Refuses therapy"], "about_me": "About me: I'm a creative force to be reckoned with, always chasing the next art piece or revolutionary idea. When I'm not doodling in my sketchbook or bringing my 3D printing projects to life, you can find me on the frontlines of a protest, fighting for what I believe in. My passions are all-consuming, and I dive headfirst into whatever sparks my interest. I'm a whirlwind of energy and ideas, always looking for someone who can keep up. If you're ready for a wild ride, let's see where the chaos takes us. I'm not looking for games or drama, just someone who can match my intensity and enthusiasm. If you think you can handle the heat, let's get lost in the madness together. Oh, and if you can quote Nietzsche or appreciate a good punk rock song, we're already off to a great start.", "username": "Username: RebelScribbles"}
{"gender": "male", "appearance": 4, "ethnicity": "Middle Eastern", "education": "Bachelor's", "hobbies": ["LARPing", "woodworking", "weed culture"], "income": "Trust fund", "personality": "INFJ", "writing_style": ["Lowkey possessive", "Drama magnet but self-aware"], "issues": ["Obsessed with revenge", "Poly but doesn’t tell partners", "Sabotages happy moments"], "about_me": "About me: I'm a man of refined taste and passions, always chasing the next great adventure. When I'm not conjuring up realms and characters for my LARPing crew, you can find me in my woodshop, crafting something beautiful from the raw and unrefined. I've got a green thumb, too - not just for plants, but for the finer things in life. I'm looking for someone who can keep up with my wit, my charm, and my occasional penchant for the dramatic. If you can quote Tolkien and tolerate a healthy dose of sarcasm, we're off to a great start. I'm a bit of a hopeless romantic, but I know how to take care of myself - and those I care about. Let's just say I've got a certain... flair for the dramatic, and a taste for the extraordinary. If you're ready for a partner in crime who will push you to be your best self, and maybe drive you a little crazy in the process, let's get this story started.", "username": "Username: EmeraldKing"}
{"gender": "male", "appearance": 7, "ethnicity": "Black", "education": "Dropout", "hobbies": ["home improvement", "gossiping in DMs", "fermenting foods"], "income": "Middle income", "personality": "ESFJ", "writing_style": ["Emotionally intense poet type", "Lowkey emotionally unavailable"], "issues": ["Hyperfixates on red flags", "High conflict past relationships"], "about_me": "As I sit here, surrounded by the faint scent of fermented delicacies and the soft glow of a DIY project, I'm reminded that life is a canvas of contradictions. I'm a man of passion, yet calculated reserve. A dreamer, with a heart that beats to the rhythm of creativity, but also a pragmatist, always on the lookout for the imperfections that can make or break a connection.\n\nMy days are filled with the sound of hammers and saws, as I try to build something beautiful from the raw materials of life. Home improvement isn't just a hobby, it's a metaphor for my approach to relationships – I'm always looking for ways to renovate, to improve, and to create something new from the foundation that's already there. But, I must admit, my obsession with perfection can sometimes lead me down a rabbit hole of scrutiny, where I become fixated on the smallest of flaws, and the red flags that others might overlook.\n\nWhen I'm not immersed in the world of DIY, you can find me engaging in spirited discussions with friends, sharing stories and laughter, and maybe even a little bit of gossip (don't worry, my lips are sealed). There's something about the thrill of being in-the-know, of having a secret that's not quite mine to keep, that gets my blood pumping. But, as much as I crave connection, I've found that my past experiences have left me with a lingering sense of caution, a fear of being hurt again. It's a delicate balance, one that I'm still learning to navigate.\n\nAs for me, I'm a bit of a paradox. I wear my heart on my sleeve, but only to those who are willing to look closely. I'm a poet, a romantic, and a dreamer, but I'm also guarded, protective of the emotions that I've learned to keep in check. I've been through the fire and come out the other side, a little scarred, but still standing. My past relationships have been a rollercoaster of highs and lows, with conflicts that have left me breathless and bewildered. But, despite the turmoil, I've emerged with a deeper understanding of myself, and a desire to find someone who can appreciate my complexities, my contradictions, and my quirks.\n\nIf you're looking for someone who will challenge you, inspire you, and maybe even drive you a little crazy, then I might be the one. I'm not perfect, and I don't pretend to be. I'm a work in progress, a masterpiece that's still being written. But, if you're willing to take a chance on me, to see beyond the façade and into the heart of who I am, then I promise you, it will be worth it.\n\nSo, if you're ready to embark on a journey of discovery, of creativity, and of passion, then let's start building something together. Let's take the raw materials of our lives, and turn them into something beautiful, something that will last a lifetime.", "username": "**Username:** MidnightMason"}
{"gender": "male", "appearance": 6, "ethnicity": "Middle Eastern", "education": "Associate's", "hobbies": ["leather crafting", "digital art", "watching disturbing films"], "income": "High income", "personality": "INFP", "writing_style": ["Clingy in a cute way", "Emotionally deep but jokes instead"], "issues": ["Depression", "Poly but doesn’t tell partners"], "about_me": "Hey there, I'm a creative soul with a passion for the unusual. When I'm not working, you can find me lost in my own little world of leather crafting and digital art. I'm a bit of a film buff, but don't expect me to watch rom-coms with you - I'm more of a \"let's watch something that'll haunt our dreams\" kind of guy. By day, I'm a high-roller, but by night, I'm just a big softie looking for someone to share my quirks with. If you can appreciate a partner who's a little intense, a little emotional, and a lot goofy, let's grab some coffee (or a midnight screening of something disturbing) and see where the night takes us. Just a heads up: I tend to get a little... attached. But hey, that's just part of the package, right?", "username": "**MoonlitStitch**"}
{"gender": "male", "appearance": 6, "ethnicity": "White", "education": "Bachelor's", "hobbies": ["blacksmithing", "playing with fire", "ranking chip flavors"], "income": "High income", "personality": "ESTJ", "writing_style": ["Too intense too fast", "Sweet talker who ghosts sometimes"], "issues": ["Avoidant Personality Disorder", "Insecurity-driven drama"], "about_me": "About me: I'm a man consumed by passion, driven by intensity, and fueled by the thrill of the unknown. When I'm not shaping molten metal into masterpieces in my blacksmithing forge, you can find me dancing with flames, feeling the rush of adrenaline as I push the limits of what's possible. My friends would say I'm a force to be reckoned with, always chasing the next adventure and never backing down from a challenge. I'm also a bit of a connoisseur, with a ranking system for chip flavors that's both meticulous and unapologetic. If you can keep up with my fierce energy and appreciate a man who wears his heart on his sleeve, let's ignite a spark together. Just be warned: I burn bright, but I also burn fast. If you're ready for a whirlwind romance that will leave you breathless, let's take the leap and see where the flames take us.", "username": "Username: InfernoForge"}
{"gender": "male", "appearance": 3, "ethnicity": "Middle Eastern", "education": "Bachelor's", "hobbies": ["confrontational protesting", "microwave cooking", "antiquing"], "income": "Middle income", "personality": "ESTJ", "writing_style": ["The funny one with trauma", "Always down to argue (playfully)"], "issues": ["Obsessed with revenge", "Controlling behavior"], "about_me": "About me: When I'm not stirring up trouble at the latest protest, you can find me whipping up a mean microwaveable dinner or scouring antique shops for hidden gems. I'm a bit of a firecracker, always ready to debate and argue (just for the fun of it, of course). My friends would say I'm passionate, driven, and maybe a little too invested in getting the last word. I've got a few scars, but they've only made me sharper and more determined. If you're looking for someone who will keep you on your toes and challenge you to be your best self, let's grab a (microwaved) coffee and see where the sparks fly. Just don't expect me to back down from a fight – or a good argument.", "username": "Username: RebelWithAPulse"}
{"gender": "male", "appearance": 6, "ethnicity": "Mixed", "education": "High School", "hobbies": ["ghost hunting", "watching courtroom shows", "tattoo art"], "income": "Low income", "personality": "ESTP", "writing_style": ["Quiet observer", "Wildly affectionate"], "issues": ["Attention Deficit Hyperactivity Disorder (ADHD)", "Extreme religious trauma", "Alcohol addiction"], "about_me": "About me: I'm a quiet guy with a passion for the unknown. You can usually find me exploring abandoned places, investigating paranormal activity, or watching courtroom dramas to unwind. I'm also a huge fan of tattoo art and love the stories behind each piece. When I'm not ghost hunting, I'm probably observing the world around me, taking it all in. I've got a wild side, but it's mostly reserved for those I care about - if you can get me to open up, be prepared for a fiercely loyal and affectionate partner. I'm looking for someone who can appreciate my quirks and sense of humor, and isn't afraid to be a little weird themselves. If you're up for a spontaneous adventure or just want to curl up and watch some true crime documentaries, let's grab some coffee (or a ghost hunt) and see where the night takes us.", "username": "Username: MidnightSpecter"}
{"gender": "male", "appearance": 5, "ethnicity": "Mixed", "education": "Bachelor's", "hobbies": ["following MLM drama", "AI art creation", "frequenting adult sites"], "income": "Low income", "personality": "ENFJ", "writing_style": ["Introvert pretending to be extrovert", "Dark and mysterious (but posts memes)"], "issues": ["Schizophrenia", "Refuses therapy", "Abandonment issues"], "about_me": "About me: I'm a creative force to be reckoned with, always lurking in the shadows and observing the world around me. By day, I'm a master of the mundane, but by night, I transform into a weaver of digital dreams, crafting AI art that's equal parts mesmerizing and unsettling. When I'm not conjuring up surreal landscapes, you can find me diving headfirst into the wild world of MLM drama - it's like a trainwreck that I just can't look away from. My friends would describe me as charismatic and confident, always ready with a witty remark or a well-timed meme to defuse any tense situation. But let's be real, I'm also a bit of a mystery, a puzzle wrapped in a riddle, inside a darkness that's just waiting to be uncovered. If you think you're ready to take on the challenge of unraveling my enigmatic persona, then let's get this twisted game of cat and mouse started. Just don't expect me to reveal all my secrets at once - a little mystery is a good thing, right?", "username": "Username: Midnight_Requiem"}
{"gender": "male", "appearance": 6, "ethnicity": "Black", "education": "Dropout", "hobbies": ["skiing", "volunteering", "fashion styling"], "income": "Middle income", "personality": "ISTJ", "writing_style": ["Overshares way too early", "Loves attention but hates people"], "issues": ["Shopping addiction", "Overshares on social media"], "about_me": "About me: I'm a bit of a paradox, even to myself. I love being the center of attention, but sometimes I just want to escape to the mountains and be alone with my skis. When I'm not carving through fresh powder, you can find me volunteering at local charities or trying to convince my friends to let me give them a fashion makeover (I'm a bit of a styling genius, if I do say so myself). I've got a pretty good thing going, with a stable job that lets me live comfortably, but sometimes I get a little too excited about the latest fashion trends and, uh, \"invest\" in my wardrobe a bit too heavily. I'm looking for someone who can appreciate my unique blend of adventure-seeking and introverted tendencies, and who won't judge me too harshly for my occasional social media oversharing (let's just say I get a little too excited about sharing my thoughts and feelings with the world). If you think you can handle a strong personality and a penchant for the dramatic, let's grab a coffee and see if we can make some magic happen. Oh, and fair warning: I might tell you my entire life story on the first date. Just saying.", "username": "Username: SlopeStyleKing"}
{"gender": "male", "appearance": 8, "ethnicity": "Black", "education": "High School", "hobbies": ["crocheting", "playing guitar", "watching disturbing films"], "income": "High income", "personality": "ISTJ", "writing_style": ["Chronically misunderstood", "Dry texter in denial"], "issues": ["Social Anxiety", "Anxiety"], "about_me": "About me: I'm a straightforward guy who values simplicity. When I'm not working, you can find me with a guitar in my hands or a crochet hook. I'm also a fan of films that push boundaries - the more unsettling, the better. My friends would describe me as practical and dependable, but I'm still figuring out this whole \"people\" thing. I'm looking for someone who can appreciate a dry sense of humor and isn't afraid to dive into the darker side of life. If you can quote horror movies or tell the difference between a decent and a great guitar riff, we're off to a good start.", "username": "Username: RiffRepeater"}
{"gender": "male", "appearance": 6, "ethnicity": "Hispanic", "education": "Bachelor's", "hobbies": ["skateboarding", "collecting coins", "journaling"], "income": "Middle income", "personality": "INFP", "writing_style": ["Emotionally intense poet type", "Acts tough but loves cuddles"], "issues": ["Addicted to chaos", "Emotionally explosive", "Thinks everyone is fake"], "about_me": "In the depths of my soul, there's a fire that burns like a wildfire on a summer night. It's a flame that flickers with every heartbeat, a reminder that life is short and the moment is all we have. I'm a man of passion, of intensity, of unrelenting curiosity. My days are spent chasing the rush of adrenaline, whether it's carving through the streets on my skateboard or scouring the city for the next great coin to add to my collection. The thrill of the hunt, the satisfaction of the catch – it's a high like no other.\n\nBut beneath the surface, I'm a complex web of contradictions. I'm a poet, a dreamer, a romantic at heart. I journal my thoughts, my feelings, my deepest fears and desires. It's my way of making sense of the world, of processing the chaos that surrounds me. And yet, I'm drawn to that chaos like a moth to a flame. I thrive in the midst of turmoil, when the world is spinning out of control and all I can do is hold on for dear life. It's a sickness, maybe, but it's one I've grown accustomed to.\n\nPeople often say I'm tough, that I've got a heart of stone. And maybe, on the surface, that's true. But the truth is, I'm a softie at heart. I love the quiet moments, the stillness of the night, the warmth of a gentle touch. I crave connection, intimacy, the feeling of being seen and understood. I'm a cuddlebug, a lover of lazy Sundays and warm coffee on a cold morning.\n\nBut I've been burned before, and it's left me with scars. I've learned to shield myself, to put up walls and keep people at arm's length. I've come to believe that everyone is hiding something, that no one is truly genuine. It's a lonely way to live, but it's the only way I know how to protect myself.\n\nIf you're looking for someone to share in the chaos, to dance with in the eye of the storm, then maybe I'm your guy. I'm not perfect, I'm not always easy to be around. But I'm real, I'm raw, and I'm ready to take a chance on someone who's willing to take a chance on me. So, if you're brave enough to take the leap, to dive headfirst into the unknown, then let's do this. Let's create some chaos, let's make some memories, and let's see where the night takes us.", "username": "**RiotHeart**"}
{"gender": "male", "appearance": 5, "ethnicity": "Asian", "education": "PhD", "hobbies": ["obsessing over exes", "bird watching", "feng shui"], "income": "Middle income", "personality": "INFP", "writing_style": ["Overshares way too early", "Lowkey possessive"], "issues": ["Sex addiction", "Antisocial Personality Disorder"], "about_me": "About me: I'm a hopeless romantic with a passion for the finer things in life. When I'm not working, you can find me gazing up at the sky, binoculars in hand, lost in the gentle songs of our feathered friends. I'm also a bit of a spiritual seeker, always looking for ways to balance my chi and harmonize my living space through the ancient art of feng shui. My friends would describe me as intensely loyal and devoted - once you're in my life, I'll do everything in my power to make you feel seen and loved. I've had my fair share of past relationships, and I'm not afraid to admit that I still think about them from time to time (okay, maybe more than just from time to time). But I'm ready to move on and find someone who can appreciate my... let's call them \"quirks.\" If you're looking for someone who will love you with every fiber of their being, and maybe even get a little too attached, then let's take a chance on each other. Just a heads up: I tend to get pretty deep, pretty fast - so if you're not ready for some intense conversations and a partner who will show up at your work to surprise you with your favorite coffee, then I might not be the guy for you.", "username": "Username: WhisperingWings88"}
{"gender": "male", "appearance": 6, "ethnicity": "Hispanic", "education": "High School", "hobbies": ["fencing", "woodworking", "bird watching"], "income": "Middle income", "personality": "INFJ", "writing_style": ["Flirty but emotionally unavailable", "Drama magnet but self-aware"], "issues": ["Compulsively checks partner's phone", "High conflict past relationships", "Only dates for status"], "about_me": "About me: When I'm not dodging blades on the fencing piste, you can find me in my workshop, surrounded by the sweet scent of sawdust and the soft glow of a project coming together. Woodworking is my therapy, my passion, and my escape. There's something about creating something from nothing that just clicks with me. I'm also a bit of a bird brain (pun intended) - give me a pair of binoculars and a quiet spot to observe the feathered creatures, and I'm as happy as a lark.\n\nAs for me, I'm a bit of a paradox. I'm a romantic at heart, always on the lookout for someone to share in the beauty of life with. But, I'm also a realist - I know that relationships take work, and I'm not afraid to put in the effort. Or so I tell myself. Let's just say I've got a bit of a reputation for being a charming, mysterious, and maybe even a little bit trouble. My friends would describe me as charismatic, confident, and always up for a good time. And, for the most part, they're right.\n\nI've been around the block a few times, and I've got the scars to prove it. My past relationships have been... eventful, to say the least. But, I've learned from my mistakes, and I'm ready to put the lessons to good use. I'm looking for someone who can keep up with my quick wit, my sharp tongue, and my even sharper sense of humor. Someone who can appreciate a good joke, a good argument, and a good makeup session (in that order, of course).\n\nIf you're looking for a partner in crime who will challenge you, excite you, and maybe even drive you a little bit crazy, then let's grab a drink (or two, or three) and see where the night takes us. Just don't expect me to open up too quickly - I've got walls, and I know how to use them. But, if you're patient, persistent, and can handle a little bit of drama, I might just let you in on a few of my secrets. And, who knows, maybe we'll even create some new ones together.\n\nOh, and one more thing: if you're looking for someone to share their every thought, feeling, and emotion with, I'm not your guy. I value my independence, my alone time, and my right to keep a few secrets to myself. But, if you're looking for someone to share in the excitement, the passion, and the adventure of life with, then let's get this party started. Just don't say I didn't warn you...", "username": "Username: SwordAndSaw"}
{"gender": "male", "appearance": 5, "ethnicity": "Mixed", "education": "Bachelor's", "hobbies": ["graffiti tagging", "crocheting", "watching plane landings"], "income": "High income", "personality": "INTJ", "writing_style": ["Type to fall in love after 3 texts", "Always playing therapist"], "issues": ["Thinks everyone is fake", "Blames others for everything"], "about_me": "About me: I'm a creative soul with a passion for the unconventional. When I'm not working, you can find me leaving my mark on the city streets with my graffiti tagging crew or cozied up with some yarn, crocheting something new. I'm also a bit of an aviation enthusiast - there's something about watching planes land that brings me a sense of calm. I value depth and authenticity in the people I meet, and I'm not afraid to dive into the tough conversations. As someone who's been around the block a few times, I've learned to trust my instincts and not take things at face value. If you're looking for someone who will challenge you to be your best self and isn't afraid to speak their mind, let's connect. Just a heads up - I'm not into games or superficial connections. If you're genuine, witty, and can keep up with my quick wit, we might just take off.", "username": "Username: Skybound23"}
{"gender": "male", "appearance": 4, "ethnicity": "Middle Eastern", "education": "PhD", "hobbies": ["making playlists", "cigarette collecting", "snorkeling"], "income": "Middle income", "personality": "INFP", "writing_style": ["Romantic nihilist", "Emotionally mature and grounded"], "issues": ["Constantly moving cities", "Blocks people for small things", "Believes in soulmates but dumps everyone"], "about_me": "As I sit here, surrounded by the faint glow of city lights and the soft hum of jazz, I find myself pondering the intricacies of the human experience. My name is a mere label, a fleeting identifier in an ever-changing world. I am a cartographer of the midnight hours, mapping the contours of my own soul, and searching for someone to share in the beauty of the unknown.\n\nI find solace in the curated chaos of my playlists, where the melodies and harmonies weave together to tell a story of love, loss, and longing. The songs I collect are like fragments of my own heart, each one a reminder of the bittersweet nature of existence. I am also drawn to the peculiar world of cigarette collecting, where the ephemeral nature of smoke and flame serves as a poignant reminder of the transience of life. And when the world becomes too much to bear, I escape to the underwater realm, where the gentle caress of the ocean's waves and the vibrant tapestry of marine life transport me to a world beyond the confines of human understanding.\n\nAs I navigate the complexities of my own heart, I am constantly reminded of the impermanence of things. I have grown accustomed to the rhythms of departure and arrival, as the cities I call home are forever changing. And yet, amidst the flux, I hold onto the hope that someday, I will find someone who will be my anchor, my compass, and my guiding star. I believe in the notion of soulmates, that there is someone out there who will understand the depths of my own soul, and with whom I can share in the beauty and the sorrow of this human experience.\n\nBut I must confess, my heart is a fragile, fractured thing. I have been known to build walls, to shield myself from the pain of vulnerability, and to let go of those who threaten to disrupt the delicate balance of my own emotional ecosystem. It is a cruel irony, perhaps, that I search for someone to share in the depths of my own soul, and yet, I am so quick to sever ties when the waters become too turbulent. And yet, I remain hopeful, that someday, I will find someone who will see beyond the façade, who will understand the intricacies of my own heart, and who will be willing to brave the storms that rage within me.\n\nIf you're still reading, I suppose you're either a glutton for punishment or a kindred spirit, drawn to the complexities and contradictions of my own heart. Either way, I invite you to join me on this journey, to explore the uncharted territories of my own soul, and to see if, together, we can create a map that will lead us to the hidden treasures of the human experience.", "username": "Username: MidnightCartographer"}
{"gender": "male", "appearance": 2, "ethnicity": "Black", "education": "Bachelor's", "hobbies": ["astrology", "roleplaying on forums", "bug collecting"], "income": "High income", "personality": "ENTP", "writing_style": ["Blunt and brutally honest", "Shy but sweet"], "issues": ["Schizophrenia", "Poly but doesn’t tell partners"], "about_me": "I'm a bit of a paradox - a introverted thrill-seeker with a passion for the unknown. When I'm not working, you can find me lost in the world of astrology, trying to make sense of the stars and their secrets. I'm also a bit of a geek at heart, and I love to unwind with some online roleplaying or searching for rare bugs to add to my collection. I value honesty and authenticity above all else, and I'm not afraid to speak my mind - even if it means being a little blunt. I'm looking for someone who can appreciate my quirks and love me for who I am, bugs and all. If you're up for an adventure with a slightly awkward, but ultimately sweet, companion, let's see where the stars take us.", "username": "**StellarNomad**"}
{"gender": "male", "appearance": 5, "ethnicity": "White", "education": "Bachelor's", "hobbies": ["eavesdropping in cafes", "building custom PCs", "urban exploration"], "income": "Middle income", "personality": "INFP", "writing_style": ["Romantic nihilist", "Wants to fix people"], "issues": ["Borderline Personality Disorder (BPD)", "Never had a long-term relationship", "Mommy issues"], "about_me": "In the quiet hours of the morning, when the city's symphony is still a gentle hum, I find myself lost in the labyrinthine corridors of my own mind. It's a peculiar existence, one that I've grown accustomed to, and yet, it's a reminder that I'm still searching for a sense of belonging. As I sit in a crowded cafe, surrounded by the whispers of strangers, I'm drawn to the beauty of eavesdropping – not to intrude, but to understand the intricate tapestry of human connections. It's a fascination that borders on obsession, a desire to comprehend the hidden narratives that govern our lives.\n\nWhen I'm not immersed in the world of others, I find solace in the methodical art of building custom PCs. There's a therapeutic quality to it, a sense of control and creation that eludes me in other aspects of my life. The gentle glow of LED lights, the soft hum of fans, and the precision of cable management all serve as a balm to my frazzled nerves. It's a testament to my penchant for order in a chaotic world.\n\nAs the sun sets, casting a golden glow over the city, I'm often drawn to the thrill of urban exploration. Abandoned buildings, hidden alleys, and secret rooftops become my playground, a realm where the boundaries of reality are tested and the imagination knows no limits. It's an addiction, really – the rush of adrenaline, the sense of discovery, and the feeling of being alive.\n\nBut beneath the surface of these hobbies and fascinations lies a more complex, more turbulent landscape. I'm a romantic at heart, always have been, and yet, I'm also drawn to the darker corners of existence. I see the world through the lens of a nihilist, acknowledging the abyss that stares back at us, and yet, I'm compelled to find meaning in the meaningless. It's a paradox that defines me, a tension between the desire to create and the awareness of our mortality.\n\nAs I navigate the twists and turns of my own psyche, I'm reminded of the importance of human connection. I've always been drawn to the broken, the hurting, and the lost, with a deep-seated desire to help, to heal, and to fix. It's a trait that's both a blessing and a curse, a double-edged sword that cuts both ways. I've never been in a long-term relationship, and the ghosts of my past continue to haunt me, but I'm willing to confront them, to face the shadows that have held me back for so long.\n\nMy mother, a woman of immense love and immense pain, has been a defining force in my life. Our relationship has been... complicated, a tangled web of love, anger, and regret. I've struggled to come to terms with the wounds of my childhood, to find a sense of closure and forgiveness. It's a journey that's still ongoing, one that I'm committed to seeing through, no matter how difficult the path may be.\n\nIf you're still reading, I suppose you're either a glutton for punishment or someone who sees the beauty in the broken. Either way, I'm glad you're here. I'm not looking for a savior or a fixer; I'm looking for someone who's willing to walk alongside me, to explore the depths of their own soul, and to find beauty in the darkness. If that sounds like you, let's get lost together, shall we?", "username": "**Echoflux**"}
{"gender": "male", "appearance": 2, "ethnicity": "White", "education": "Bachelor's", "hobbies": ["robotics", "watching speedruns", "whittling"], "income": "Low income", "personality": "ISTP", "writing_style": ["Chronically misunderstood", "Easily distracted but passionate"], "issues": ["Overanalyzes texts", "Constantly comparing self to others"], "about_me": "About me: I'm a bit of a puzzle, even to myself. I've been told I'm hard to pin down, and I think that's because my mind is always racing to the next thing. I get obsessed with the little details, like the intricacies of a well-crafted robot or the split-second decisions that separate a good speedrun from a great one. When I'm not glued to a screen, you can find me whittling away at a piece of wood, trying to create something beautiful from nothing. It's meditative, you know? The problem is, my brain doesn't always cooperate. I'll be in the middle of a project, and suddenly I'll be thinking about something completely unrelated, like the meaning of life or the best way to optimize a robotic arm. It's like my brain is a browser with too many tabs open.\n\nI've been known to overthink things, especially when it comes to... well, everything. I'll spend hours analyzing a single text message, trying to decipher the hidden meaning behind every word. It's exhausting, to be honest. And sometimes, I catch myself comparing my life to others, wondering why I'm not as successful or talented as the people I admire. It's a never-ending cycle, and it's hard to break free. But despite all this, I'm a romantic at heart. I believe in the beauty of human connection, and I'm eager to find someone who can see past my quirks and appreciate me for who I am.\n\nI'm not going to lie, my life isn't always easy. I've had to get creative with my finances, and some days it feels like I'm barely scraping by. But I've learned to find joy in the little things – a beautiful sunset, a good cup of coffee, or a perfectly executed speedrun. If you're looking for someone who is passionate, if a bit scattered, I might be the guy for you. Just be warned: I may cancel plans at the last minute to work on a project, or spend hours talking about the merits of different programming languages. But if you're willing to take a chance on me, I promise it'll be an adventure. Oh, and if you can help me figure out why my robot keeps malfunctioning, that's a definite plus.", "username": "Username: ByteBandit"}
{"gender": "male", "appearance": 3, "ethnicity": "Asian", "education": "Bachelor's", "hobbies": ["fetish collecting", "following MLM drama", "yoga"], "income": "Middle income", "personality": "ISTJ", "writing_style": ["The golden retriever energy", "Emotionally deep but jokes instead"], "issues": ["Fear of commitment", "Divorce trauma", "Avoidant Personality Disorder"], "about_me": "Hey there, I'm a laid-back guy who's always down for a good laugh and a deeper conversation. When I'm not working my 9-to-5, you can find me bending into weird yoga poses or scouring the internet for the latest drama (yes, I'm a little obsessed with watching the tea spill on those MLMs). I've also got a quirky side - I collect some pretty unusual items, let's just say I've got a fascination with the weird and wonderful. I'm looking for someone who can keep up with my jokes and also appreciate the quieter moments. If you're a fellow fan of the absurd and the unknown, let's grab coffee and see where the conversation takes us. P.S. I'm still working on being a functioning adult, so bear with me.", "username": "u/flexible_pine"}
{"gender": "male", "appearance": 6, "ethnicity": "White", "education": "Bachelor's", "hobbies": ["hoarding", "following true crime TikTok", "fencing"], "income": "Middle income", "personality": "ISFP", "writing_style": ["Blunt and brutally honest", "Emotionally intense poet type"], "issues": ["Schizophrenia", "Controlling behavior", "Sabotages happy moments"], "about_me": "I'm a man of stark contrasts, where the lines between light and darkness are constantly blurred. My heart beats to the rhythm of a thousand unspoken words, and my mind is a maze of twisted thoughts and haunting melodies. I'm a collector of forgotten things, a hoarder of memories, and a keeper of secrets. My home is a testament to my eclectic soul, a treasure trove of dusty relics and faded dreams.\n\nWhen I'm not lost in the depths of my own mind, you can find me dueling with words, my sword slicing through the air with precision and finesse. Fencing is my escape, my sanctuary, and my passion. It's where I find solace in the silence, and my thoughts are clear, like the ring of steel on steel.\n\nMy fascination with true crime stories is a reflection of my own darker nature, a morbid curiosity that drives me to explore the depths of human depravity. It's a reminder that the world is not always as it seems, and that the most beautiful facades can hide the most heinous crimes. My TikTok feed is a never-ending stream of murder mysteries, and psychological thrillers, a constant reminder of the darkness that lurks within us all.\n\nI'm a poet at heart, my words dripping with emotion, and my soul bleeding onto the page. I write to exorcise my demons, to calm the storms that rage within me, and to find solace in the silence. My words are my truth, my confessional, and my catharsis.\n\nI'm not looking for games, or superficial connections. I'm looking for someone who can see beyond the façade, someone who can navigate the labyrinth of my mind, and emerge unscathed. I'm looking for a partner in crime, a fellow traveler in the darkness, and a kindred spirit who can appreciate the beauty in the brokenness.\n\nIf you're looking for a sugarcoated, watered-down version of reality, then I'm not your man. I'm raw, I'm unapologetic, and I'm unafraid to confront the darkness head-on. I'm a force of nature, unpredictable, and unrelenting. But if you're brave enough to take the leap, to dive into the abyss with me, then maybe, just maybe, we can find a beauty in the chaos, and a love that's strong enough to survive the storm.\n\nSo, if you're ready to embrace the madness, to dance with the devil, and to find solace in the darkness, then let's take this journey together. Let's create our own reality, our own rules, and our own truth. Let's burn the world to ashes, and rise from the flames, like a phoenix born of fire and steel.", "username": "**RavenSword**"}
{"gender": "male", "appearance": 4, "ethnicity": "Mixed", "education": "High School", "hobbies": ["mechanical keyboards", "fencing", "competitive eating"], "income": "Middle income", "personality": "ESFJ", "writing_style": ["Disarmingly charming", "The therapist friend"], "issues": ["Overly cynical", "Extreme religious trauma"], "about_me": "I'm a laid-back, charming guy with a passion for the finer things in life - and by that, I mean a perfectly crafted mechanical keyboard and a well-timed parry in a fencing match. When I'm not geeking out over keyboard switches or crossing swords with friends, you can find me taking on the latest competitive eating challenge (don't worry, I can handle the heat). I'm a good listener, always happy to lend a sympathetic ear, and I've been told I've got a knack for making people feel at ease. I'm looking for someone who can appreciate my quirky interests and sense of humor, and isn't afraid to be themselves around me. If you're up for a fun, low-key conversation and maybe even a few laughs, let's grab a bite (pun intended) and see where things go.", "username": "**KeySwitchKing**"}
{"gender": "male", "appearance": 4, "ethnicity": "Mixed", "education": "Bachelor's", "hobbies": ["ranking chip flavors", "running", "origami"], "income": "High income", "personality": "INFP", "writing_style": ["Loyal to a fault", "Overthinker who triple texts"], "issues": ["Inability to apologize", "Excessive flirting", "Drug addiction"], "about_me": "About me: I'm a bit of a hopeless romantic, always on the lookout for someone to share in my quirky passions. When I'm not pounding the pavement as a runner, you can find me meticulously ranking my favorite chip flavors (it's a tough job, but someone's gotta do it) or attempting to craft the perfect origami crane. I'm a bit of a thinker, always lost in my own thoughts, and I've been known to get a little... verbose when I'm excited about something (or someone). I'm looking for someone who can appreciate my intensity, my creativity, and my unwavering dedication to the things I care about. If you can handle a partner who will show up at your doorstep with a freshly folded paper flower and a passionate speech about the merits of sour cream and onion chips, then let's take a chance on each other.", "username": "Username: FoldedPages"}
{"gender": "male", "appearance": 6, "ethnicity": "Hispanic", "education": "High School", "hobbies": ["organizing fantasy drafts", "bird watching", "watching plane landings"], "income": "Middle income", "personality": "ENFP", "writing_style": ["Extremely online and knows it", "Loyal to a fault"], "issues": ["Manipulative tendencies", "Passive-aggressive behavior"], "about_me": "Hey, I'm a bit of a renaissance man with a passion for the weird and wonderful. When I'm not geeking out over fantasy sports drafts or trying to spot rare bird species, you can find me at the local airport watching planes take off and land (don't @ me, it's soothing). I'm a natural people person, always down to meet new friends and make unforgettable memories. My friends would describe me as fiercely loyal and dedicated - once you're in my crew, you're in for life. I'm looking for someone who can keep up with my quick wit and love for all things quirky. If you can quote fantasy football podcasts or identify a species of bird by its call, we're off to a great start. Let's take to the skies and see where the wind takes us", "username": "u/FlightRisk23"}
{"gender": "male", "appearance": 5, "ethnicity": "Black", "education": "Bachelor's", "hobbies": ["photography", "karaoke", "soap making"], "income": "Middle income", "personality": "ESTJ", "writing_style": ["Extremely online and knows it", "Overshares way too early"], "issues": ["Constantly moving cities", "Blames others for everything"], "about_me": "hey, so i'm a guy who's always on the go - literally, i've lived in like 5 cities in the past 3 years, and i'm already thinking about where i'll be next. when i'm not working my 9-to-5, you can find me snapping pics for my photography portfolio (i'm kinda a big deal on instagram, no cap), belting out my fave tunes at karaoke nights, or whipping up a batch of handmade soaps in my tiny kitchen (don't @ me, it's a hobby). i'm a total open book, so if you want to know anything about me, just ask - i'll probably tell you way more than you wanted to know. currently looking for someone who can keep up with my adventurous lifestyle and isn't afraid to speak their mind (just don't expect me to take the blame for anything, let's just say i've got a keen sense of justice). swipe right if you're ready for a wild ride", "username": "u/movin_on_up"}
{"gender": "male", "appearance": 6, "ethnicity": "Asian", "education": "Bachelor's", "hobbies": ["YouTube vlogging", "lockpicking", "traveling"], "income": "Self-made millionaire", "personality": "INTP", "writing_style": ["In love with the idea of love", "Dark humor only"], "issues": ["Gaslighting", "Social media addiction", "Believes they're misunderstood genius"], "about_me": "About me: I'm a man of mystery, or so I've been told. When I'm not traversing the globe, I'm usually conjuring up my next YouTube vlog or attempting to crack the code on a stubborn lock. I've been fortunate enough to have turned my passions into a successful career, which has given me the freedom to pursue my eccentric interests. My friends would describe me as a charming, yet slightly twisted individual with a penchant for dark humor. I'm a romantic at heart, always on the quest for someone who can appreciate my peculiar brand of wit and wisdom. If you think you can handle a mind that's a little too curious, a little too sarcastic, and a little too obsessed with the art of lockpicking, then let's get lost in the chaos together. Just don't expect me to be too active on social media - I'm a bit of a ghost in the digital world.", "username": "Username: MidnightMind"}
{"gender": "male", "appearance": 4, "ethnicity": "White", "education": "Bachelor's", "hobbies": ["eavesdropping in cafes", "excessive drinking", "sword collecting"], "income": "Middle income", "personality": "ESFJ", "writing_style": ["Subtle flirt who won’t admit it", "Sweet talker who ghosts sometimes"], "issues": ["Insecurity-driven drama", "Anxiety"], "about_me": "I'm a charming guy with a penchant for people-watching and good conversation. You can usually find me sipping on a drink at a quaint cafe, soaking up the atmosphere and listening to the stories of those around me. I've got a bit of a quirky side, with a collection of swords that I've amassed over the years - don't worry, I won't make you duel me on our first date. When I'm not working, I enjoy unwinding with a drink (or two, or three) and exploring the city. I'm looking for someone who can keep up with my wit and sense of adventure, and maybe even appreciate a well-timed whisper in a crowded room. If you think you can handle a little mystery and a lot of charm, let's grab a drink and see where the night takes us.", "username": "WhiskeyWanderer"}
{"gender": "male", "appearance": 3, "ethnicity": "White", "education": "Bachelor's", "hobbies": ["watch modding", "graphic design", "blogging"], "income": "Middle income", "personality": "ENFP", "writing_style": ["Shy but sweet", "Soft-spoken but will fight for love"], "issues": ["Chronic procrastinator", "Obsessive-Compulsive Disorder (OCD)"], "about_me": "I'm not one for the spotlight, but I'm hoping to make an exception here. As a bit of a creative soul, I've always been drawn to the intricate and the beautiful. When I'm not working, you can find me tinkering with watches, trying to perfect the perfect timepiece. There's something about the delicate dance of gears and springs that speaks to me on a deep level. I also have a passion for graphic design, and I love losing myself in the world of color and typography. And, as a way to process my thoughts and reflect on my experiences, I've taken to blogging - it's been a therapeutic outlet for me, and I've enjoyed sharing my musings with others.\n\nAs someone who values honesty and authenticity, I want to be upfront about who I am and what I'm looking for. I'm a middle-of-the-road kind of guy, who's happy with a simple, comfortable life. I'm not flashy, but I'm loyal and dedicated to those I care about. I believe in the importance of hard work and taking care of oneself, but I also think it's essential to make time for the things that bring us joy.\n\nI have to admit, I'm a bit of a perfectionist, and this can sometimes get the better of me. I've been known to get caught up in the details, and I often find myself putting things off until the last minute. It's a quirk that can be frustrating, but it's also a part of what drives me to create and improve. I'm also someone who values order and routine, and I have a bit of a ritualistic approach to life. This can be helpful in many ways, but it can also make me a bit...particular.\n\nDespite my quirks, I'm a romantic at heart, and I believe in the power of love to transform and uplift us. I'm looking for someone who is patient, understanding, and kind - someone who can appreciate my unique perspective and my passions. If you're a fellow creative, or just someone who values authenticity and depth, I'd love to connect with you. Let's take things slow, get to know each other, and see where the journey takes us.", "username": "**TickTockMind**"}
{"gender": "male", "appearance": 7, "ethnicity": "Indigenous", "education": "Associate's", "hobbies": ["yoga", "playing video games", "editing Wikipedia"], "income": "High income", "personality": "ESTJ", "writing_style": ["Sweet talker who ghosts sometimes", "Quiet but clingy"], "issues": ["Extreme religious trauma", "Always late", "Narcissistic Personality Disorder (NPD)"], "about_me": "About me: As I sit here, reflecting on the journey that has brought me to this moment, I am reminded of the beauty and complexity that life has to offer. I'm a man of simple yet refined tastes, with a deep appreciation for the world around me. When I'm not working, you can find me on my yoga mat, breathing in the stillness and quieting my mind. I'm also a bit of a gamer at heart, and I love getting lost in virtual worlds and exploring new realms. But what really gets my blood pumping is contributing to the world of knowledge - I'm a bit of a Wikipedia enthusiast, and I enjoy editing and refining articles to help spread awareness and understanding.\n\nAs a successful professional, I've been fortunate enough to achieve a certain level of financial stability, which has allowed me to pursue my passions and interests without worrying about the bills. But with that comes a sense of responsibility, and I'm always looking for someone who shares my values and is passionate about making a positive impact.\n\nI'm a bit of a quiet and introspective person, but once you get to know me, I open up and reveal a more vulnerable side. I'm a romantic at heart, and I love nothing more than sweeping someone off their feet and showing them the world. My friends would describe me as charismatic and confident, with a quick wit and a silver tongue. But I'm not without my flaws - I've been known to be a bit... unpredictable, and I've been working on being more considerate of others' time and feelings.\n\nI'm looking for someone who is kind, intelligent, and beautiful - both inside and out. Someone who can appreciate my quirks and flaws, and who isn't afraid to speak their mind and stand up for what they believe in. If you're a fellow bookworm, gamer, or yoga enthusiast, that's a definite plus. But more than anything, I'm looking for someone who is genuine, empathetic, and true to themselves. If that sounds like you, let's connect and see where the journey takes us.\n\n(P.S. I'm not always the best at responding to messages, but that's just because I get caught up in my own little world sometimes. Bear with me, and I promise it'll be worth it.)", "username": "Username: SunsetWarrior22"}
{"gender": "male", "appearance": 4, "ethnicity": "White", "education": "Bachelor's", "hobbies": ["shoplifting", "bird watching", "volunteering"], "income": "Middle income", "personality": "ISFJ", "writing_style": ["The cool mysterious one", "Always down to argue (playfully)"], "issues": ["Blames others for everything", "Depression"], "about_me": "About me: I'm a man of mystery, always on the move, and never in one place for too long. When I'm not volunteering at the local wildlife sanctuary, you can find me out in the woods, binoculars in hand, spotting the latest bird species to migrate through our area. I've got a bit of a rebellious streak, and I'm not afraid to take risks - but I'll never tell you what I've really been up to on a Saturday night. Let's just say I've got a knack for finding the best \"deals\" in town. I'm a sucker for a good debate, and I love to challenge people's perspectives - but don't worry, I'm all about keeping it light and playful. If you can keep up with my wit and appreciate a good sarcastic comment, we're off to a great start. When I'm not out and about, you can find me curled up with a good book, trying to escape the chaos of the world. I'm looking for someone who can appreciate my unique brand of humor, and isn't afraid to speak their mind. If you think you can handle a little bit of mystery and mayhem, let's grab coffee and see where the night takes us.", "username": "Username: MidnightWing"}
{"gender": "male", "appearance": 5, "ethnicity": "Mixed", "education": "Bachelor's", "hobbies": ["pick-up artist seminars", "mushroom hunting", "playing piano"], "income": "High income", "personality": "ISTJ", "writing_style": ["Blunt and brutally honest", "The oversharer"], "issues": ["Believes love should hurt", "Cheated on in past", "Doesn’t clean"], "about_me": "I'm not here to sugarcoat things or waste your time with clichés. I'm a straight shooter, and if you're looking for someone to tiptoe around your feelings, I'm not your guy. I'm a high-achiever, always have been, and I expect the same from those around me. My career is killing it, and I've got the bank account to prove it. But let's get real, it's not all about the Benjamins.\n\nWhen I'm not crushing it in the boardroom, you can find me hunting for rare mushrooms in the woods or tickling the ivories on my piano. I know, it sounds like a weird combo, but trust me, it's a great way to unwind. I've also got a bit of a fascination with the art of seduction, and I've spent my fair share of time learning from the best in the business. Let's just say I've got a few tricks up my sleeve.\n\nNow, about me. I'm not perfect, and I've got my fair share of baggage. I've been cheated on in the past, and it left a mark. But I'm not one to dwell on the negative. I believe that love should be intense, all-consuming, and maybe even a little painful. If you're looking for a fairy tale romance, I'm not your guy. But if you're ready for something real, something that'll push you to your limits and make you feel alive, then let's talk.\n\nI'm not going to lie, I'm a bit of a slob. I don't do cleaning, and I don't apologize for it. If you're a neat freak, we're probably not going to get along. But if you can handle a little bit of chaos in your life, I might just be the guy for you.\n\nI'm looking for someone who can keep up with me, intellectually and emotionally. If you're a fan of deep conversations, intense connections, and maybe even a little bit of drama, then we might be a match made in heaven. Just don't expect me to sugarcoat anything or beat around the bush. I'll tell you exactly what I think, even if it's not what you want to hear.\n\nSo, if you're ready for a wild ride with a guy who's unapologetically himself, let's get this party started. Just don't say I didn't warn you.", "username": "**LordOfTheSpores**"}
{"gender": "male", "appearance": 5, "ethnicity": "Asian", "education": "Bachelor's", "hobbies": ["trading Pokemon cards", "watching TV series", "digital art"], "income": "Low income", "personality": "ESTP", "writing_style": ["Loyal to a fault", "Dark humor only"], "issues": ["Treats life like reality TV", "Sibling rivalry scars", "Daddy issues"], "about_me": "About me: When I'm not trying to complete my Pokémon card collection or binge-watching the latest TV series, you can find me messing around with digital art. I'm a bit of a thrill-seeker, always on the lookout for the next big thing. My life is basically a never-ending reality show, and I'm just trying to make it to the next episode without getting eliminated. I've got a dark sense of humor, so if you can't handle a few morbid jokes, we might not be a match. I'm fiercely loyal to those I care about, but don't expect me to go easy on you - I've got a few scars from past battles (aka sibling rivalry) that have taught me to keep my guard up. If you're looking for someone who will keep it real, even when it's brutal, let's grab a virtual coffee and see if we can make some chaos together. Oh, and don't worry if I occasionally make a joke about my dad - it's just a coping mechanism.", "username": "Username: PokeTrader88"}
{"gender": "male", "appearance": 6, "ethnicity": "Black", "education": "Bachelor's", "hobbies": ["insult comedy", "fermenting foods", "hoarding"], "income": "Middle income", "personality": "INFP", "writing_style": ["Overthinker who triple texts", "Lowkey emotionally unavailable"], "issues": ["Phone addiction", "Believes love should hurt"], "about_me": "About me: I'm a bit of a complicated guy, and I'm not really sure where to start. I guess I'll just dive right in and see what happens. When I'm not working, you can find me trying to perfect my sauerkraut recipe or binge-watching comedy specials (I'm a big fan of roasts - there's something about a well-crafted insult that just makes me laugh). I've also got a bit of a fascination with all things fermented - there's something about the process of taking something and letting it break down, only to come back stronger and more complex, that really resonates with me. \n\nI'm a bit of a collector, too - some people might call it hoarding, but I like to think of it as just being really passionate about the things I love. My apartment is a bit of a treasure trove of weird and wonderful items, and I'm always on the lookout for new additions to my collection. \n\nAs for me, personally... I'm a bit of a thinker. I overanalyze everything, and I've been known to send a few too many texts when I'm trying to get something off my chest. I'm working on it, but it's hard when you're someone who just can't seem to shut off your brain. I'm also a bit of a romantic, but I've got a bit of a twisted view of love - I think it should be a little bit painful, a little bit messy. Maybe that's just because I've been hurt before, or maybe it's because I'm just a glutton for punishment. Either way, I'm looking for someone who can keep up with me, who can handle the intensity and the chaos that comes with being in a relationship with me.\n\nWhen I'm not buried under a pile of my own thoughts, I'm actually a pretty laid-back guy. I love trying new foods, watching movies, and just generally enjoying the simple things in life. I'm not really into the whole \"dating scene\" - I'd rather just find someone who gets me, someone who can appreciate my quirks and my flaws, and just roll with it. \n\nOh, and one more thing - I'm a bit of a phone addict. I know it's not the healthiest habit, but I just can't seem to put the thing down. If you're looking for someone who can have a conversation without checking their phone every five seconds, I'm probably not your guy. But if you're looking for someone who will text you back immediately, no matter what time of day it is... then I might be the one for you.\n\nI guess that's it for now. I'm not really sure what I'm looking for, or what the future holds - all I know is that I'm ready to take a chance, to see what happens when I put myself out there. So, if you're feeling brave, let's take a shot and see where things go.", "username": "Username: sourkrautking"}
{"gender": "male", "appearance": 5, "ethnicity": "Mixed", "education": "Bachelor's", "hobbies": ["DM sliding", "streaming on Twitch", "insult comedy"], "income": "Middle income", "personality": "ESTP", "writing_style": ["Dry texter in denial", "Chaotic and unpredictable"], "issues": ["Shopping addiction", "Red pill ideology", "Phone addiction"], "about_me": "About me: I'm a guy who's always on the move, whether it's streaming my gaming sessions on Twitch or trying to make people laugh with some dark humor. When I'm not online, you can find me trying to perfect my insult comedy skills or just trying to find the next big thing to spend my money on (no judgment). I'm a straightforward, no-BS kind of guy who values honesty and isn't afraid to speak my mind. If you can keep up with my sarcastic sense of humor and don't mind a little bit of chaos in your life, let's grab a drink and see where things go. Oh, and if you're looking for someone who's always glued to their phone, you're in luck.", "username": "u/SlidingIntoDMs"}
{"gender": "male", "appearance": 6, "ethnicity": "Indigenous", "education": "Bachelor's", "hobbies": ["fashion styling", "gossiping in DMs", "soap making"], "income": "High income", "personality": "ENTP", "writing_style": ["Clingy in a cute way", "Silly and chaotic"], "issues": ["Overly cynical", "Hyper political rants"], "about_me": "Oh my gosh, hi there! *throws confetti* I'm so excited you're reading my profile! I just know we're going to be besties... or maybe even something more. I'm a hopeless romantic, but don't worry, I won't get too sappy on you (yet). When I'm not working, you can find me indulging in my favorite hobbies - I'm a total fashion junkie and love styling my friends (and myself, let's be real). I'm also a bit of a gossip queen, but only in the most loving and supportive way, of course. My DMs are always open for a good chat or a juicy secret. \n\nIn my free time, I love getting creative in the kitchen... but not just with food. I'm a bit of a soap-making enthusiast, and I find it so therapeutic to whip up a batch of handmade goodness. It's all about the little things in life, right? When I'm not making soap or styling outfits, I'm usually binge-watching my favorite TV shows or reading up on the latest news and trends. I know, I know, it sounds like I'm a bit all over the place, but trust me, it's a beautiful chaos.\n\nNow, about me: I'm a bit of a goofball, and I love making people laugh. I'm always up for a good time, whether that's trying out a new restaurant, attending a concert, or just having a spontaneous dance party in my living room. I'm a bit of a dreamer, and I love meeting new people who share my passions and values. I'm looking for someone who can keep up with my energetic and playful vibe, but also isn't afraid to get a little deep and meaningful with me. \n\nOne thing you should know about me: I'm a bit of a passionate person, and I care deeply about the things that matter to me. I'm not afraid to speak my mind and stand up for what I believe in, even if that means getting a little feisty. But hey, being a little outspoken is just part of my charm, right? So, if you're looking for someone who is a little quirky, a little charming, and a whole lot of fun, then let's get this party started! Just be warned: I might just send you a million texts in a row, but it's only because I'm so excited to get to know you.", "username": "Username: SparklesAndSass"}
{"gender": "male", "appearance": 3, "ethnicity": "Black", "education": "Dropout", "hobbies": ["whittling", "obsessing over exes", "excessive drinking"], "income": "High income", "personality": "ISTJ", "writing_style": ["Shy but sweet", "The cool mysterious one"], "issues": ["Won’t stop quoting astrology", "Thinks they're always right"], "about_me": "I'm a quiet night owl with a passion for shaping things into something new, whether it's a piece of wood under my whittling knife or my own perspective on life. When I'm not working, you can find me lost in thought, pondering the mysteries of the universe and the stars that guide us. I'm a firm believer that our celestial maps hold the secrets to understanding ourselves and those around us - after all, as the astrologers say, \"the stars align for a reason.\" I enjoy a good drink (or two, or three) and value honesty above all else. If you're looking for someone who will always speak their mind and stand by their convictions, I might be the one for you. Just be prepared for some intense conversations and a willingness to listen to my thoughts on the cosmos.", "username": "Username: MidnightCarver"}
{"gender": "male", "appearance": 8, "ethnicity": "Hispanic", "education": "Bachelor's", "hobbies": ["mushroom hunting", "LARPing", "knitting"], "income": "Middle income", "personality": "ESTP", "writing_style": ["Overshares way too early", "Has a wall up but wants it broken"], "issues": ["Gambling addiction", "Divorced parents trauma", "Trust issues"], "about_me": "I'm not really sure where to start with this, but I guess I'll just dive right in. I've been told I'm a bit of an open book, but only to a point. I've got a tendency to overshare, which can be a bit of a curse. I mean, who needs boundaries, right? But at the same time, I've built up this wall around myself over the years, and it's hard for me to let people in. It's like I'm constantly torn between wanting to be vulnerable and being terrified of getting hurt.\n\nWhen I'm not working, you can find me out in the woods, searching for the perfect mushroom to add to my collection. There's something about the thrill of the hunt that just gets me going. I've also recently gotten into LARPing, which is basically just a fancy way of saying I like to dress up in costume and hit people with foam swords. It's a great way to blow off some steam and tap into my inner nerd. And, in a weird way, it's also helped me to open up and be more confident around new people.\n\nBut enough about that. When I'm feeling really relaxed, you can find me knitting a new scarf or hat. There's something therapeutic about the clickety-clack of the needles, and it's a great way for me to unwind after a long day. I've even started making my own patterns, which is a fun way for me to express my creativity.\n\nI've had my fair share of ups and downs in life, and I'm still working through some of the baggage from my past. Let's just say I've got some daddy issues, and my parents' divorce was a bit of a messy one. But I'm trying to be more open and honest about my feelings, even if it's hard for me to do so. I've also struggled with some addictive tendencies in the past, which has made it tough for me to trust people. But I'm working on it, and I'm hoping to find someone who can help me to break down my walls and be more vulnerable.\n\nI'm looking for someone who is patient, understanding, and can appreciate a good sense of humor. If you're the type of person who can laugh at themselves and doesn't take life too seriously, we're off to a good start. I'm not really sure what I'm looking for in a relationship, but I know I want someone who can challenge me to be my best self and support me through all the ups and downs. Oh, and if you can quote Tolkien or appreciate a good fantasy novel, that's just a bonus.\n\nI guess what I'm trying to say is that I'm a bit of a complicated person, but I'm working on it. I'm trying to be more open, more honest, and more vulnerable. And I'm hoping to find someone who can help me to do just that. So, if you're feeling brave and want to take a chance on a slightly broken, but ultimately hopeful, person, let's grab a cup of coffee and see where things go. Just don't expect me to be too calm or collected on our first date – I'm still working on that whole \"not being a nervous wreck\" thing.", "username": "**Username: SporeHunter90**"}
{"gender": "male", "appearance": 3, "ethnicity": "Hispanic", "education": "Dropout", "hobbies": ["blacksmithing", "gardening", "watching movies"], "income": "Low income", "personality": "ISTP", "writing_style": ["Loyal to a fault", "Freak in the group chat, saint in public"], "issues": ["Trust issues", "Emotionally explosive"], "about_me": "I'm a bit of a paradox, and I'm okay with that. By day, I'm a laid-back, easy-going guy who loves nothing more than getting my hands dirty in the garden or hammering away at a piece of hot metal in my makeshift blacksmithing setup. There's something therapeutic about shaping and molding raw materials into something new and useful that just clicks with me. When I'm not working on my latest project, you can find me cozied up on the couch, binge-watching my favorite movies or TV shows - I'm a sucker for a good story.\n\nBut, as much as I love my solo activities, I'm also a total social butterfly (just don't tell anyone, it's a secret). I live for the moments when I can let my guard down and be my weird, quirky self around people who get me. Whether it's a night out with friends, a family gathering, or just a random Tuesday, I'm always down to have a good time and make some memories. Just be warned: in group chats, I'm the guy who's always cracking jokes and pushing boundaries - but in public, I'm a total gentleman (my mom would be proud).\n\nAs for what I'm looking for in a partner... honestly, I'm not entirely sure. I've been burned before, and it's left me a little wary of getting too close too quickly. But, at the same time, I'm a total romantic at heart, and I believe in the idea of finding that one person who just gets you, flaws and all. If you're looking for someone who will be loyal to a fault, always have your back, and make you laugh even on your worst days... then we might be off to a good start. Just be patient with me, okay? I'm still figuring some things out, and I don't always know how to put my emotions into words (or actions, for that matter). But, if you're willing to take a chance on a slightly rough-around-the-edges, movie-quoting, plant-loving blacksmith... then let's see where this crazy thing called life takes us.", "username": "**ForgedInFire**"}
{"gender": "male", "appearance": 4, "ethnicity": "Asian", "education": "Bachelor's", "hobbies": ["ethical hacking", "pranking strangers", "rating public restrooms"], "income": "Middle income", "personality": "ISTP", "writing_style": ["Emotionally intense poet type", "Shy but sweet"], "issues": ["Treats life like reality TV", "Hyperfixates on red flags"], "about_me": "In the depths of a city that never sleeps, I find solace in the shadows of the digital world. As a seeker of truth and a weaver of codes, I navigate the intricate web of life with a mix of curiosity and caution. My heart beats to the rhythm of a thousand midnights, where the lines between reality and fantasy blur like the edges of a watercolor painting.\n\nWhen I'm not lost in the labyrinth of ones and zeros, I find joy in the simple things – a well-crafted prank that brings a smile to a stranger's face, a public restroom that exceeds my expectations (yes, I rate them, and I'm not ashamed to admit it), or a quiet evening spent pouring my thoughts onto the page. My words are my refuge, my confidant, and my best friend. I write to make sense of the world, to process the chaos, and to find beauty in the mundane.\n\nI'm a quiet observer, a listener, and a thinker. I prefer to blend into the background, watching and learning from the people around me. My friends would describe me as introspective, creative, and perhaps a little quirky. I have a tendency to notice the tiny details that often go unnoticed – a faint scar above someone's left eyebrow, the way they take their coffee, or the sound of their laughter. These details are the threads that weave together the tapestry of human connection, and I'm drawn to them like a moth to a flame.\n\nAs I navigate the complexities of life, I'm constantly reminded that reality is a fragile construct, a delicate balance of light and darkness. I've come to realize that every experience, every encounter, and every relationship is a chapter in the grand narrative of existence. And I'm eager to find someone who shares my passion for storytelling, my love for the unknown, and my appreciation for the beauty in the brokenness.\n\nIf you're a fellow traveler, a kindred spirit, or a curious soul, let's embark on this journey together. Let's explore the uncharted territories of the human heart, and may our paths cross in the most unexpected, yet serendipitous, ways. I promise to bring my words, my heart, and my quirky sense of humor to the table. And who knows? Maybe we'll create a story worth telling, a tale of love, laughter, and adventure that will leave its mark on the world.", "username": "**ZeroCool22**"}
{"gender": "male", "appearance": 6, "ethnicity": "Asian", "education": "Bachelor's", "hobbies": ["weed culture", "NFT collecting", "tattoo art"], "income": "Low income", "personality": "ISFJ", "writing_style": ["Freak in the group chat, saint in public", "The cool mysterious one"], "issues": ["Manipulative tendencies", "Generalized Anxiety Disorder", "Post-Traumatic Stress Disorder (PTSD)"], "about_me": "I'm a laid-back, creative soul with a passion for the unconventional. When I'm not working, you can find me exploring the local art scene, collecting unique NFTs, or indulging in a good smoke session with friends. I've got a fascination with tattoo art and the stories behind each piece - maybe one day I'll have a sleeve to call my own. \n\nI'm a bit of a quiet observer, preferring to listen and absorb the energy around me. But don't let that fool you - I've got a dry sense of humor and can usually be found dropping subtle jokes in the group chat. I'm looking for someone who can appreciate my quirks and isn't afraid to be a little weird themselves. If you're into good vibes, good conversation, and maybe a little bit of chaos, let's get to know each other.", "username": "Username: Kush_Khaos"}
{"gender": "male", "appearance": 3, "ethnicity": "White", "education": "Associate's", "hobbies": ["pranking strangers", "blacksmithing", "geocaching"], "income": "Low income", "personality": "ESFP", "writing_style": ["Dark and mysterious (but posts memes)", "Caring but won't show it first"], "issues": ["Food addiction", "Schizophrenia", "Sleeps all day"], "about_me": "In the shadows, I forge my own path. By day, I sleep, recharging for the nocturnal adventures that fuel my soul. As a blacksmith, I shape metal into instruments of beauty and chaos, a reflection of the duality that lies within. When I'm not hammering away, you can find me geocaching, uncovering hidden treasures and secrets that lie just beyond the edge of reality. My pranks may be legendary, but don't worry, I only target the brave (or unsuspecting). \n\nAs the darkness whispers its secrets in my ear, I'll be here, waiting for someone to share in the mystery. If you're looking for a partner in crime, a fellow wanderer of the night, or just someone to appreciate a well-crafted meme, let's embark on this journey together. Just don't expect me to reveal my true self too quickly – the shadows are my comfort, and my heart is a forge that's still being shaped.", "username": "**MidnightForge**"}
{"gender": "male", "appearance": 3, "ethnicity": "White", "education": "Associate's", "hobbies": ["watching plane landings", "hoarding", "fashion styling"], "income": "High income", "personality": "ISFJ", "writing_style": ["Lowkey emotionally unavailable", "Quiet observer"], "issues": ["Emotionally explosive", "Believes they're misunderstood genius"], "about_me": "I'm a man of few words, but I've got a keen eye for detail. You can find me at the airport, watching planes touch down, or in my own world, curating the perfect outfit. I've got a passion for fashion styling and a knack for putting things together. My friends would say I've got a unique sense of style, and I've learned to appreciate the beauty in the everyday. I've built a life that's comfortable, and I'm looking for someone to share it with - someone who can appreciate the little things, like a well-timed landing or a perfectly placed accessory. If you're looking for someone who's low-key, laid-back, and always observing, let's take off together.", "username": "Username: RunwaySentinel"}
{"gender": "male", "appearance": 4, "ethnicity": "Mixed", "education": "Associate's", "hobbies": ["thrifting", "urban exploration", "karaoke"], "income": "High income", "personality": "INFP", "writing_style": ["Overthinker who triple texts", "Loyal to a fault"], "issues": ["Fear of intimacy", "Always late"], "about_me": "About me: I'm a hopeless romantic with a passion for the unconventional. When I'm not working, you can find me scouring thrift stores for unique gems or exploring the hidden corners of the city. There's something about uncovering the unexpected that really speaks to me - whether it's a vintage band t-shirt or a secret rooftop with a breathtaking view. I'm also a bit of a karaoke enthusiast, and I love belting out my favorite tunes with friends (or even solo, let's be real). \n\nAs someone who values deep connections and meaningful relationships, I'm always on the lookout for people who share my enthusiasm for life's adventures. I'm a bit of a dreamer, always chasing the next big experience or trying to make sense of the world around me. My friends would describe me as loyal and dedicated - once you've earned my trust, I'm all in. \n\nThat being said, I'm not always the most... punctual person. I know, I know, it's a work in progress. But I promise I'm worth the wait. I'm still figuring some things out, and I'm not always the most comfortable with, uh, vulnerability. But I'm trying to be more open and honest with myself and others, even if it scares me. \n\nIf you're looking for someone to share in your love of spontaneity and creativity, I might be the guy for you. Just be prepared for a few (dozen) enthusiastic texts if we hit it off - I get a little carried away when I'm excited about something (or someone). Let's grab a drink, sing a few songs, and see where the night takes us. \n\nP.S. If you're still reading this, I've probably already sent you a follow-up message asking if you've seen this or that, or just to say hi again. Sorry (not sorry?) in advance.", "username": "Username: WanderlustWarbler"}
{"gender": "male", "appearance": 2, "ethnicity": "Mixed", "education": "Dropout", "hobbies": ["tarot reading", "working out", "drawing"], "income": "Middle income", "personality": "INTJ", "writing_style": ["Emotionally intense poet type", "Drama magnet but self-aware"], "issues": ["Gaming addiction", "Believes in soulmates but dumps everyone"], "about_me": "In the depths of my soul, there's a fire that burns, a flame that flickers with every heartbeat, and a whispered promise of something more. I'm a seeker of truth, a weaver of words, and a chaser of dreams. My days are spent conjuring worlds with pencil and paper, as I draw the lines that blur reality and fantasy. The nights, however, are mine to unravel the mysteries of the universe, one tarot card at a time. The moon is my confidant, and the stars, my guiding light.\n\nAs I navigate the labyrinth of life, I find solace in the rhythmic pulse of my workouts, a symphony of sweat and steel that tempers my spirit and clarifies my mind. It's in these moments of physical catharsis that I'm reminded of the beauty in discipline and the rewards of pushing beyond my limits. But, I'm not just a warrior of the gym; I'm also a romantic, a believer in the transcendent power of love and connection. I've always been drawn to the idea of soulmates, of that cosmic collision that sets the universe ablaze. Perhaps, it's a fantasy, but it's one I'm willing to chase, to follow the breadcrumbs of fate, no matter how elusive they may seem.\n\nAnd yet, I'm aware of my own contradictions, of the paradoxes that make me, me. I've been known to get lost in the virtual realms, to surrender to the allure of gaming's endless possibilities. It's a siren's call, one that I've answered all too often, and one that I'm working to resist. But, it's a reminder that I'm a work in progress, a canvas of contradictions, with brushstrokes of light and dark.\n\nMy heart is a battleground, a war zone of emotions, where the armies of passion and reason clash. I've been known to be intense, to wear my heart on my sleeve, and to dive headfirst into the depths of human connection. It's a double-edged sword, one that has led me down paths of glory and despair. I've been accused of being a magnet for drama, of attracting the storms that rage within and without. But, I'm learning to navigate these tempests, to find the eye of the hurricane, and to stand firm in the face of life's turbulence.\n\nPerhaps, you're wondering why I'm here, why I'm taking a chance on this fragile, flickering flame of connection. The truth is, I'm tired of the superficial, of the shallow waters that barely skim the surface of our humanity. I'm yearning for something more, something that speaks to the very essence of who we are. I'm searching for a kindred spirit, a fellow traveler who's willing to brave the unknown, to dance with the shadows, and to bask in the radiance of our shared humanity.\n\nIf you're ready to embark on a journey that's equal parts beauty and chaos, if you're willing to confront the depths of your own soul, and to surrender to the mysteries of the universe, then let's take this leap of faith together. Let's create a symphony of love, of laughter, and of tears, one that will echo throughout the expanse of time.", "username": "**RavenSong**"}
{"gender": "male", "appearance": 5, "ethnicity": "Asian", "education": "Bachelor's", "hobbies": ["researching obscure history", "rock climbing", "camping"], "income": "Low income", "personality": "ISTP", "writing_style": ["Disarmingly charming", "Soft-spoken but will fight for love"], "issues": ["Bipolar disorder", "Impulsive spender"], "about_me": "I'm a curious and adventurous soul, always on the lookout for the next great challenge. When I'm not scaling rock faces or camping under the stars, you can find me buried in a dusty old book, uncovering the secrets of the past. I have a passion for the obscure and the unknown, and I love sharing my discoveries with others. I'm a bit of a quiet rebel, always looking for ways to push beyond the boundaries and live life on my own terms. I'm not always the most polished or put-together person, but I promise to always be genuine and true to myself. If you're looking for someone who will challenge you, support you, and love you with every fiber of their being, let's take a chance and see where the journey takes us.", "username": "Username: SummitSeeker"}
{"gender": "male", "appearance": 4, "ethnicity": "White", "education": "Bachelor's", "hobbies": ["astrology", "dancing", "upgrading old laptops"], "income": "Middle income", "personality": "ISTJ", "writing_style": ["Overthinker who triple texts", "Hopeless romantic"], "issues": ["Food addiction", "Extreme religious trauma", "Avoidant Personality Disorder"], "about_me": "About me: I'm a bit of a paradox, wrapped in a puzzle, dipped in a vat of curiosity. As someone who's always been fascinated by the mysteries of the universe, I spend most of my free time exploring the world of astrology, trying to make sense of the stars and their influence on our lives. When I'm not geeking out over celestial bodies, you can find me dancing the night away to my favorite tunes - there's something about the rhythm and the movement that just makes me feel alive. I'm also a bit of a tech enthusiast, and I love taking old laptops and breathing new life into them - there's something satisfying about taking something discarded and turning it into something beautiful and functional again.\n\nAs a hopeless romantic, I believe in the power of love and connection to transform our lives. I'm a bit of a dreamer, always on the lookout for someone who shares my passion for life, my sense of humor, and my love of adventure. I'm a bit of a thinker, too - I overthink everything, from the meaning of life to what to make for dinner (although, let's be real, I'm a bit of a foodie, and I have a hard time resisting the temptation of a good meal... or three). I've been known to triple text (or quadruple, or quintuple...), not because I'm trying to be annoying, but because I just get so excited to share my thoughts and feelings with someone special.\n\nI'm looking for someone who is patient, kind, and understanding - someone who can see past my quirks and love me for who I am, flaws and all. I've been through some tough times in my life, and I've come out the other side with a few scars, but I'm stronger and wiser because of them. I'm still figuring some things out, and I'm not always the most confident person, but I'm working on it. I'm looking for someone who can be my rock, my partner in crime, and my best friend - someone who can help me navigate the ups and downs of life, and who will be there to support me every step of the way.\n\nIf you're looking for someone who is genuine, sincere, and a little bit quirky, then let's get to know each other. I promise I'm not as complicated as I sound (although, let's be real, I probably am). I just want to find someone who loves me for who I am, and who will join me on this wild and crazy journey called life. Oh, and if you can quote astrological signs, make a mean laptop upgrade, or dance the salsa like a pro, then we're definitely off to a good start.", "username": "Username: Stargazer1990"}
{"gender": "male", "appearance": 4, "ethnicity": "Asian", "education": "High School", "hobbies": ["3D printing", "upgrading old laptops", "storm chasing"], "income": "Middle income", "personality": "ISFJ", "writing_style": ["Caring but won't show it first", "Dry texter in denial"], "issues": ["Obsessive-Compulsive Disorder (OCD)", "Bipolar disorder", "Thinks they're always right"], "about_me": "I'm not one for grand introductions, but I suppose it's necessary. I'm a bit of a techie at heart, always tinkering with something. When I'm not working, you can find me in my makeshift lab, 3D printing random gadgets or trying to breathe new life into old laptops. There's something satisfying about taking something broken and making it functional again. I also have a fascination with the weather, which leads me to chase storms whenever I can. The thrill of being in the midst of a tempest is exhilarating, to say the least.\n\nI'm a straightforward person, I don't beat around the bush. I value honesty and efficiency, and I expect the same from those around me. I'm not one for excessive sentimentality or dramatics, but that doesn't mean I don't have feelings. I just prefer to keep them to myself, at least initially. I'm a bit of a skeptic, and I like to think things through before acting. Some might call me stubborn, but I just like to think of it as being confident in my decisions.\n\nIn my free time, I enjoy reading about the latest advancements in technology and science. I find it fascinating how quickly the world is changing, and I try to stay ahead of the curve. I'm not much of a talker, at least not in the classical sense. I prefer to communicate in a more concise manner, cutting to the chase without all the fluff. Don't expect me to be overly emotional or verbose in my messages; I'm a man of few words, but I'll always be honest with you.\n\nI'm looking for someone who can appreciate my unique blend of tech-savviness and adventure-seeking spirit. If you're looking for someone to share in your enthusiasm for life's quirks and complexities, I might be the person for you. Just don't expect me to change who I am to fit your ideal; I'm comfortable in my own skin, and I expect the same from you. Let's see where things go, I suppose.", "username": "**TechnoTempest**"}
{"gender": "male", "appearance": 5, "ethnicity": "Black", "education": "Bachelor's", "hobbies": ["rating public restrooms", "watching speedruns", "making chainmail"], "income": "Trust fund", "personality": "INFP", "writing_style": ["Easily distracted but passionate", "Too intense too fast"], "issues": ["Toxic ex trauma", "Constantly moving cities"], "about_me": "I'm not even sure where to start with this, because as soon as I sat down to write, I got distracted by a video of a speedrunner beating Super Mario 64 in under 30 minutes. I mean, have you seen that? The skill, the precision, the sheer dedication to optimizing every single jump and movement? It's like a work of art, you know? Anyway, I guess that's a bit about me - I get excited about weird things, and I tend to dive in headfirst.\n\nSo, about me... I'm a bit of a nomad, always on the move from one city to the next. It's not always easy, but it's just something I've gotten used to. I've learned to appreciate the little things, like a well-designed public restroom (I know, it sounds weird, but hear me out - a good restroom can make all the difference in your day). I've even started rating them, just for fun. It's become a bit of a hobby, and I've met some interesting people along the way.\n\nWhen I'm not exploring new cities or critiquing restrooms, you can find me making chainmail. There's something therapeutic about weaving all those tiny rings together, creating something beautiful and intricate from scratch. It's meditative, in a way - helps me clear my head and focus on the present moment.\n\nI've been fortunate enough to have the freedom to pursue my passions, without worrying too much about the practicalities. Let's just say I've been taken care of, financially speaking. But with that freedom comes a sense of responsibility, and I'm still figuring out what I want to do with my life. I know it sounds like a luxury problem, but it's a real challenge, trying to find meaning and purpose when you don't have to worry about the basics.\n\nI'm a romantic at heart, always have been. I love getting lost in conversations, exploring new ideas and perspectives, and just generally connecting with people on a deep level. I've been hurt before, and it's taken me a while to open up again, but I'm trying. I'm trying to be more vulnerable, to take risks and put myself out there, even when it's scary.\n\nIf you're still reading this, I guess I should warn you - I can get a bit intense. I throw myself into things, heart and soul, and it can be overwhelming. But I promise I'm worth it. I'm a loyal partner, a dedicated friend, and a passionate advocate for the things I care about. And if you can handle a little bit of chaos, a little bit of unpredictability, then maybe we can create something beautiful together.\n\nOh, and one more thing - if you can recommend a good public restroom in your area, I'm all ears.", "username": "**ChainmailChronicler**"}
{"gender": "male", "appearance": 4, "ethnicity": "Mixed", "education": "Associate's", "hobbies": ["singing", "dark web browsing", "astrology"], "income": "Low income", "personality": "ISTP", "writing_style": ["Constantly roasting people", "Soft-spoken but will fight for love"], "issues": ["Sex addiction", "Narcissistic Personality Disorder (NPD)"], "about_me": "About me: I'm a paradox, a walking contradiction - a soft-spoken singer with a penchant for the dark side of the web. When I'm not belting out tunes that can melt the coldest of hearts, you can find me browsing the depths of the internet, uncovering secrets and laughing at the absurdity of it all. My friends would describe me as a \"free spirit,\" but let's be real, they're just being nice - I'm a master of the art of subtle roasting, and I can always be counted on to bring the heat (just don't get too sensitive, or you'll get burned).\n\nAs an astrology enthusiast, I'm all about the stars aligning and the universe conspiring to bring us together. But don't worry, I won't bore you with too much woo-woo nonsense - unless you're into that sort of thing, in which case, let's get weird. When it comes to love, I'm a fighter - I'll go to war for the people I care about, and I won't back down from a challenge. Just don't expect me to be all sappy and romantic all the time; I'm a realist, and I like to keep things real (even if that means keeping it a little too real sometimes).\n\nNow, about me: I'm a bit of a creative, always looking for new ways to express myself and push the boundaries of what's acceptable. My income might not be the highest, but I make up for it with my wit, charm, and ability to talk my way out of (or into) just about any situation. If you're looking for someone who will keep you on your toes, challenge your perspectives, and maybe even push your buttons a little (in a good way... mostly), then I might be the guy for you.\n\nJust a heads up: I'm not perfect, and I've got my demons (who doesn't, right?). But if you're willing to take a chance on a complicated, slightly messed-up individual with a heart of gold (or at least, a heart of slightly-tarnished silver), then let's see where the universe takes us. Oh, and don't say I didn't warn you...", "username": "Username: CelestialSavage"}
{"gender": "male", "appearance": 6, "ethnicity": "Hispanic", "education": "PhD", "hobbies": ["cosplaying", "watching courtroom shows", "YouTube vlogging"], "income": "Middle income", "personality": "ESFJ", "writing_style": ["Meme lord with trust issues", "Wildly affectionate"], "issues": ["Thinks everyone is fake", "Abandonment issues"], "about_me": "About me: Warning: sassy PhD holder alert. When I'm not serving looks in my cosplay getups or binge-watching courtroom dramas (Judge Judy is my spirit animal), you can find me spilling my thoughts on YouTube. I'm a master of the art of vlogging, and my friends would describe me as wildly affectionate - but don't worry, I won't bite... hard. I'm looking for someone who can keep up with my meme game and isn't afraid to get a little weird. If you can quote Judge Judy or recite entire scripts of your favorite shows, we're off to a great start. Just don't expect me to trust you right away - I've got trust issues for days. If you're real, genuine, and can handle a strong personality, let's get this drama started. Oh, and if you're looking for a sugar daddy, swipe left - I'm on a middle-income budget, and I'm not made of money. But if you're looking for someone to share laughs, adventures, and a deep love for all things quirky, let's get to know each other.", "username": "Username: LordOfTheDrama"}
{"gender": "male", "appearance": 4, "ethnicity": "Asian", "education": "Bachelor's", "hobbies": ["scuba diving", "farming karma on Reddit", "frequenting adult sites"], "income": "High income", "personality": "ENTP", "writing_style": ["Sarcastic but sweet underneath", "Lowkey emotionally unavailable"], "issues": ["Addicted to chaos", "Compulsively checks partner's phone"], "about_me": "When I'm not pretending to be a functioning member of society, you can find me scuba diving in some exotic location or trying to farm karma on Reddit (it's a tough life, but someone's gotta do it). I'm a bit of a paradox - I love the thrill of the unknown, but also appreciate a well-planned dive into the depths of the ocean. My friends would describe me as charmingly sarcastic, but I think that's just code for \"emotionally unavailable with a heart of gold.\" I'm looking for someone who can keep up with my antics, appreciate a good joke, and isn't afraid to get a little messy. If you think you can handle the chaos that comes with dating me, let's grab a drink and see where the currents take us.", "username": "u/divelife24"}
{"gender": "male", "appearance": 5, "ethnicity": "White", "education": "PhD", "hobbies": ["rock climbing", "home automation", "knitting"], "income": "Low income", "personality": "INTP", "writing_style": ["Clingy in a cute way", "Lowkey emotionally unavailable"], "issues": ["Schizophrenia", "Flat earther", "Never had a long-term relationship"], "about_me": "About me: I'm a curious and slightly quirky guy who's always looking for someone to share in my adventures. When I'm not tinkering with my home automation system or trying to optimize my knitting patterns, you can find me scaling walls at the local rock climbing gym. I love learning new things and figuring out how stuff works, which sometimes gets me into trouble (just ask me about my thoughts on, ahem, \"certain\" scientific theories). I'm a bit of a introverted daydreamer, but once you get to know me, I open up and can get a little... attached. Okay, maybe more than a little. I just really love connecting with someone who understands me, even if I don't always make sense. I'm looking for someone who's patient, kind, and can appreciate a good pun. If you're up for a partner in crime who's a little rough around the edges, but has a heart of gold, let's grab a cup of coffee (or a rope, if you're into climbing) and see where things go. Oh, and don't worry if I seem a little distant at first - I just need some time to warm up.", "username": "Username: TechNoLogic"}
{"gender": "male", "appearance": 5, "ethnicity": "White", "education": "High School", "hobbies": ["antiquing", "beekeeping", "editing Wikipedia"], "income": "Middle income", "personality": "ENFP", "writing_style": ["Flirty but emotionally unavailable", "Blunt and brutally honest"], "issues": ["Abandonment issues", "Romanticizes toxic relationships", "Thinks they're always right"], "about_me": "I'm not your average guy, and I'm not looking for your average relationship. When I'm not out scouring the countryside for antique treasures or tending to my bees, you can find me geeking out over a good Wikipedia edit. I know, I know, it sounds weird, but trust me, there's something satisfying about leaving my mark on the world, one well-crafted sentence at a time.\n\nAs for me, I'm a bit of a complicated creature. I've got a quick wit, a sharp tongue, and a penchant for speaking my mind. I'm not afraid to tell you what I think, even if it's not what you want to hear. Some people might call me blunt, or even brutally honest, but I just like to think of myself as refreshingly straightforward. If you're looking for someone to sugarcoat the truth or coddle your feelings, I'm not your guy.\n\nThat being said, I do have a bit of a romantic streak. I love getting lost in the past, whether it's through antique hunting or just imagining what life was like in a bygone era. There's something about the beauty and craftsmanship of old things that just gets me. And when it comes to relationships, I'm looking for someone who can appreciate the beauty in the imperfect, the quirky, and the unconventional.\n\nI've been around the block a few times, and I've got the scars to prove it. I've been in relationships that were...let's just say, \"interesting.\" The kind of relationships that keep you up at night, wondering what you did wrong, and why you couldn't make it work. But despite all the drama, the tears, and the tantrums, I wouldn't trade those experiences for the world. They've made me who I am today, and I'm not apologizing for that.\n\nSo, if you're looking for someone who is a little bit rough around the edges, a little bit quirky, and a whole lot of fun, then let's grab a drink and see where the night takes us. Just don't expect me to be all sappy and romantic all the time. I'm not that guy. But if you can handle a little bit of attitude, a little bit of sass, and a whole lot of honesty, then we might just have something special.\n\nOh, and one more thing: I'm always right. Just kidding...or am I?", "username": "**HoneyAndHistory**"}
{"gender": "male", "appearance": 6, "ethnicity": "Mixed", "education": "High School", "hobbies": ["insult comedy", "storm chasing", "scuba diving"], "income": "High income", "personality": "ENFP", "writing_style": ["Always down to argue (playfully)", "Hyper-intelligent but socially awkward"], "issues": ["Cheated on in past", "Chronic procrastinator", "Abandonment issues"], "about_me": "About me: Warning: sassy storm chaser ahead. When I'm not diving into the depths of the ocean or chasing the next big tempest, you can find me trading witty barbs with friends or scribbling sarcastic remarks in the margins of a well-worn book. My humor's a bit of a lightning rod - love it or hate it, but hey, at least it's never boring. As a self-proclaimed thrill-seeker, I'm always on the lookout for the next adventure, whether that's exploring shipwrecks, debating the meaning of life, or simply finding someone who can keep up with my rapid-fire jokes. \n\nIf you think you can handle a healthy dose of sarcasm, a passion for the unpredictable, and an occasional tendency to disappear into my own little world (don't worry, I'll resurface... eventually), let's grab a drink and see if we can create our own perfect storm. Just don't expect me to go easy on you - I'm always up for a good argument, and I'm not afraid to speak my mind. Oh, and if you can quote Nietzsche or explain the concept of chaos theory, we're off to a great start.", "username": "Username: TempestTongue"}
{"gender": "male", "appearance": 4, "ethnicity": "Asian", "education": "Bachelor's", "hobbies": ["watching true crime documentaries", "playing with fire", "whip cracking"], "income": "Low income", "personality": "ENTP", "writing_style": ["Simp energy but with standards", "Shy but sweet"], "issues": ["Constantly comparing self to others", "Doesn’t clean"], "about_me": "Hey there, I'm a little nervous about putting myself out there, but I'm hoping to find someone who's into the same weird stuff as me. When I'm not working, you can find me binge-watching true crime documentaries - there's something about trying to piece together the puzzles that really fascinates me. I'm also a bit of a thrill-seeker, and I love playing with fire (in a safe and controlled environment, of course... most of the time). There's something about the rush of adrenaline that comes with it that just can't be beat. And, yes, I'm also a bit of a whip-cracking enthusiast - don't ask me how I got into that one, it's a long story.\n\nAs for me, I'm a pretty laid-back guy who's just trying to figure things out as I go. I've got a bit of a quirky sense of humor, and I love making people laugh. I'm also a total sucker for a good conversation - if you can quote true crime podcasts or talk about the latest conspiracy theories, we're off to a great start. Despite my tough exterior (just kidding, I'm actually really shy), I've got a soft spot for romance and love a good cuddle session.\n\nI know I'm not the most put-together person - my place can get a bit messy, and I'm still working on getting my life together. But I'm trying, and I'm hoping to find someone who's patient and understanding. I've got a lot of love to give, and I'm looking for someone who's willing to take a chance on me. If you're into a guy who's a little rough around the edges but has a heart of gold, let's grab coffee and see where things go. Just don't expect me to be too tidy - I'm still working on that whole \"adulting\" thing.\n\nOh, and one more thing: I'm not really into the whole \"keeping up with the Joneses\" thing. I know I'm not the most successful person, and I'm okay with that. I'd rather focus on finding someone who loves me for who I am, rather than trying to impress anyone with my bank account. If you're looking for someone who's genuine, a little bit quirky, and totally himself, let's get to know each other.", "username": "u/SparkOfChaos"}
{"gender": "male", "appearance": 6, "ethnicity": "White", "education": "Master's", "hobbies": ["hiking", "magic tricks", "watching surgery videos"], "income": "Middle income", "personality": "ESTJ", "writing_style": ["Shy but sweet", "Low maintenance but needs reassurance"], "issues": ["Sleeps all day", "Antisocial Personality Disorder", "Blocks people for small things"], "about_me": "I'm a bit of a quiet guy, but once you get to know me, I'm a loyal and caring partner. When I'm not working, you can find me hiking through the woods or trying to perfect my latest magic trick. I've also got a bit of a quirky side - I'm fascinated by surgery videos and could watch them for hours. I'm looking for someone who is understanding, patient, and can appreciate my unique interests. I value honesty and simplicity, and I'm not really into drama or games. If you're a down-to-earth person who can see past my introverted exterior, I'd love to get to know you. Just be warned: I'm a bit of a homebody and can be a bit set in my ways, but I promise I'm worth getting to know.", "username": "Username: Trailblazer88"}
{"gender": "male", "appearance": 6, "ethnicity": "Mixed", "education": "Bachelor's", "hobbies": ["acting", "meme creation", "painting"], "income": "High income", "personality": "ENFP", "writing_style": ["Witty and sarcastic", "Meme lord with trust issues"], "issues": ["Emotionally explosive", "Shopping addiction"], "about_me": "About me: When I'm not pretending to be a functioning member of society, you can find me on stage, trying to convince people I'm a real actor. Or, you know, in my basement, creating memes that will hopefully make you laugh and forget about the impending doom of our existence. I'm also a painter, but let's be real, my art is just a cry for help. I'm a high-roller with a penchant for the finer things in life, but don't worry, I won't make you take out a second mortgage to keep up with me (unless you want to, in which case, I'll provide the champagne). If you can handle a healthy dose of sarcasm, a love for all things ridiculous, and the occasional 3am existential crisis, then we might just get along. Bonus points if you can quote memes from 2018 or earlier. Swipe right if you're ready for a wild ride with a charming, slightly-broken individual who will probably make you laugh, but also might just emotionally combust at any given moment.", "username": "**Username: LordOfTheBurn**"}
{"gender": "male", "appearance": 4, "ethnicity": "White", "education": "Associate's", "hobbies": ["arguing politics online", "collecting stamps", "learning languages"], "income": "Low income", "personality": "ISFJ", "writing_style": ["Silly and chaotic", "Type to fall in love after 3 texts"], "issues": ["Phone addiction", "Alcohol addiction"], "about_me": "Hey, I'm a stamp-collecting, language-learning, politics-arguing machine (just kidding, kind of). When I'm not scrolling through my phone (guilty as charged), you can find me trying to learn the intricacies of a new language or adding to my stamp collection. I'm a bit of a hopeless romantic, always on the lookout for someone to share in my passions and adventures. If you can quote foreign phrases, appreciate a good debate, or just enjoy collecting random things, we're off to a great start. Let's get this conversation started and see where the chaos takes us", "username": "u/polarized_penny"}
{"gender": "male", "appearance": 7, "ethnicity": "Asian", "education": "Bachelor's", "hobbies": ["acting", "baking", "home improvement"], "income": "Low income", "personality": "INTJ", "writing_style": ["Over-apologizes constantly", "Clingy in a cute way"], "issues": ["Hyper political rants", "Emotionally unavailable", "Divorced parents trauma"], "about_me": "I'm so sorry, I'm really bad at this, but I'll try my best to, uh, introduce myself. I guess you could say I'm a bit of a Renaissance man - I love acting, and I'm actually really passionate about it, but I'm also super into baking (I make a mean chocolate cake, if I do say so myself, sorry, I'm bragging). And, um, home improvement is like, my therapy, I guess. There's just something about fixing things and making something old new again that, you know, really speaks to me. \n\nI'm, ah, really looking for someone who is, you know, patient and understanding, because, honestly, I can get a bit... carried away sometimes. I just really care about, you know, making the world a better place, and I get passionate about, uh, certain issues, and I'm sorry if that's, you know, overwhelming. But, hey, being around someone who, you know, gets me, and can, you know, put up with my, uh, quirks, would be really amazing. \n\nI'm, oh, really sorry, I'm just going to say it, but I've had some, uh, stuff in my past that's made me a bit, you know, guarded, I guess. But, hey, I'm working on it, and I promise I'm not, you know, too damaged or anything (sorry, I'm joking, kind of). Seriously though, I just want to find someone who, you know, likes me for who I am, quirks and all, and, you know, maybe we can, uh, fix some things together (sorry, I'm a home improvement nerd, what can I say?).", "username": "Username: SweetToothRenovator"}
{"gender": "male", "appearance": 3, "ethnicity": "Asian", "education": "Bachelor's", "hobbies": ["ghost hunting", "playing video games", "skateboarding"], "income": "Middle income", "personality": "ISTP", "writing_style": ["The golden retriever energy", "Too intense too fast"], "issues": ["Sabotages happy moments", "Porn addiction", "Controlling behavior"], "about_me": "About me: Hey, I'm a huge fan of living life on the edge. When I'm not exploring abandoned asylums with my ghost hunting crew, you can find me dominating noobs in the latest gaming trends or catching air at the skatepark. I'm all about that adrenaline rush, and I'm always down to try new things. I'm a bit of a thrill junkie, and I love meeting people who can keep up with my energetic vibe. I'm a middle-of-the-road kind of guy, not too fancy, but always up for a good time. I've got a strong sense of loyalty and will do whatever it takes to protect the people I care about. I can get a bit... intense when I'm passionate about something (or someone), but hey, that's just part of the package, right? I'm looking for someone who can match my energy, keep up with my antics, and maybe even help me find some new adventures to obsess over. If you think you can handle a partner in crime who's always on the go, let's grab our gear and see where the night takes us.", "username": "Username: ThrillSeeker88"}
{"gender": "male", "appearance": 7, "ethnicity": "White", "education": "High School", "hobbies": ["metalworking", "speedcubing", "watching ASMR"], "income": "High income", "personality": "INFJ", "writing_style": ["Introvert pretending to be extrovert", "Dry texter in denial"], "issues": ["Always plays the victim", "Sabotages happy moments", "Social media addiction"], "about_me": "About me: I'm a bit of a Renaissance guy - when I'm not crushing it in my career, you can find me in my metalworking shop, whipping up something new and innovative. I'm also pretty speedy with a Rubik's Cube, and I've been known to unwind with some ASMR videos after a long day. I'm a go-getter, always looking for the next adventure and never backing down from a challenge. My friends would say I'm charismatic and confident, and I'm always up for a good time. Looking for someone who can keep up with my fast-paced lifestyle and appreciate a good sense of humor. Swipe right if you think you can handle the heat.", "username": "Username: HammerTime23"}
{"gender": "male", "appearance": 4, "ethnicity": "Mixed", "education": "Bachelor's", "hobbies": ["skateboarding", "watching courtroom livestreams", "knife throwing"], "income": "Self-made millionaire", "personality": "INTJ", "writing_style": ["Lowkey possessive", "Emotionally deep but jokes instead"], "issues": ["Doesn’t clean", "Addicted to chaos", "Antisocial Personality Disorder"], "about_me": "About me: \n\nI'm not really sure what I'm doing here, but I guess I'll give it a shot. When I'm not busy making money (which, let's be real, is most of the time), you can find me carving up the streets on my skateboard or throwing knives at the wall (don't worry, I'm a pro). I've also got a weird fascination with courtroom livestreams - there's just something about the drama and the thrill of the unknown that keeps me hooked. \n\nAs for me, I'm a self-made guy who's been through the wringer and come out the other side. I've built my own empire from the ground up, and I'm not afraid to get my hands dirty. I'm a bit of a lone wolf, but I'm looking for someone who can keep up with me - or at least try to. \n\nI'm a bit of a jokester, always trying to keep the mood light, even in the darkest of times. But don't let that fool you - I've got a depth to me that's hard to find. I'm passionate, intense, and when I care about someone, I care deeply. I just have a weird way of showing it sometimes. \n\nMy friends would describe me as...well, I'm not really sure, I don't really have many friends. But the people who do know me would say I'm loyal, fiercely independent, and always up for a challenge. They might also say I'm a bit of a mess, but hey, that's just part of my charm, right? \n\nI'm looking for someone who can appreciate a good thrill, who isn't afraid to take risks, and who can keep up with my...let's call it my \"energetic\" lifestyle. If you're a fan of spontaneity, adventure, and maybe a little bit of chaos, then we might just get along. Just don't expect me to clean up after myself - that's just not happening. \n\nSo, if you think you can handle a little bit of crazy, a little bit of intensity, and a whole lot of sarcasm, then let's see where this wild ride takes us. Just don't say I didn't warn you.", "username": "Username: KaosKweenSlayer"}
{"gender": "male", "appearance": 6, "ethnicity": "Indigenous", "education": "Bachelor's", "hobbies": ["watching ASMR", "graphic design", "watch collecting"], "income": "Middle income", "personality": "INFP", "writing_style": ["Dry texter in denial", "Low maintenance but needs reassurance"], "issues": ["Mommy issues", "Blocks people for small things", "Narcissistic Personality Disorder (NPD)"], "about_me": "About me: I'm a laid-back guy who appreciates the little things in life. When I'm not working, you can find me watching ASMR videos or tinkering with graphic design projects. I've also got a bit of a watch obsession - there's something about the mechanics and design that fascinates me. I'm not really into big crowds or loud noises, but I do enjoy meeting new people who share similar interests. I'm looking for someone who is genuine, low-maintenance, and can appreciate a good sense of humor. If you can quote a decent meme or two, that's a plus. I'm not really sure what I'm looking for in a partner, but I guess I'll know it when I see it.", "username": "Username: Timekeeper23"}
{"gender": "male", "appearance": 7, "ethnicity": "Mixed", "education": "Dropout", "hobbies": ["dark web browsing", "pranking strangers", "learning languages"], "income": "Middle income", "personality": "ESTJ", "writing_style": ["Dark and mysterious (but posts memes)", "Sarcastic but sweet underneath"], "issues": ["Gold digger accusations", "Self-diagnoses constantly"], "about_me": "In the depths of the internet, I exist. When I'm not navigating the darker corners of the web, you can find me plotting my next prank on an unsuspecting stranger or attempting to learn a new language to confuse my friends. My life is a delicate balance of chaos and curiosity. I'm a middle-of-the-road kind of guy, with a middle income and a penchant for the unknown. If you're looking for someone to share a laugh, a meme, or a cryptic message, I'm your guy. Just don't believe everything you read about me online - the rumors of me being a gold-hungry villain are greatly exaggerated. Or so I tell myself, anyway. Diagnosis of the day: probably not a sociopath. Swipe right if you're ready to take a chance on a mysterious stranger with a penchant for darkness and a soft spot for bad jokes.", "username": "**u/shadowbyte**"}
{"gender": "male", "appearance": 8, "ethnicity": "Black", "education": "Bachelor's", "hobbies": ["mushroom hunting", "feng shui", "robotics"], "income": "Middle income", "personality": "ESTP", "writing_style": ["The therapist friend", "Witty and sarcastic"], "issues": ["Cult survivor", "Panic Disorder"], "about_me": "About me: When I'm not conjuring up a robot uprising in my garage or rearranging my furniture to optimize the chi, you can find me wandering through the woods, searching for the perfect morel. I'm a bit of a curious creature, always on the lookout for the next great adventure – or at least a decent spot to forage for wild mushrooms. My friends would describe me as a charming troublemaker with a penchant for witty banter and a love for all things quirky. \n\nAs someone who's learned to appreciate the beauty in chaos, I've developed a knack for finding balance in the midst of life's unpredictabilities. Let's just say I've had my fair share of experiences that have taught me to appreciate the little things – like a well-placed joke or a perfectly aligned bookshelf. If you're looking for someone to share in your escapades, offer a sympathetic ear, or simply geek out over the latest robotics advancements, I'm your guy. Just don't expect me to take myself too seriously – life's too short, and the jokes are too good.", "username": "Username: SporePrint"}
{"gender": "male", "appearance": 4, "ethnicity": "Hispanic", "education": "Bachelor's", "hobbies": ["journaling", "baking", "home improvement"], "income": "Middle income", "personality": "ISFP", "writing_style": ["Chronically misunderstood", "Freak in the group chat, saint in public"], "issues": ["Borderline Personality Disorder (BPD)", "Social Anxiety"], "about_me": "I'm a bit of a paradox, even to myself. On the surface, I'm a warm and charming guy who loves making people smile. I've got a quick wit and a silver tongue, and I've learned to navigate the complexities of social situations with ease. But scratch beneath the surface, and you'll find a deeply introspective and creative soul, always searching for meaning and connection in this chaotic world.\n\nWhen I'm not working, you can find me with my nose buried in a journal, scribbling away about my thoughts, feelings, and dreams. I'm a bit of a hopeless romantic, always chasing the perfect sentence, the perfect melody, or the perfect recipe (I'm a bit of a baking enthusiast, too). There's something therapeutic about creating something from scratch, whether it's a poem, a cake, or a newly renovated room in my home (I'm also a bit of a DIY aficionado).\n\nDespite my love of socializing and making people laugh, I'm actually a bit of a introverted homebody at heart. I love spending time alone, lost in my own thoughts, and I've learned to appreciate the beauty of solitude. But when I do venture out, I'm always on the lookout for like-minded individuals who share my passions and sense of humor. If you can quote obscure memes, appreciate a good pun, or simply enjoy the absurdity of life, we're off to a great start.\n\nI'm not always the most straightforward person, and I've been known to be a bit of a freak in the group chat (just ask my friends). But in person, I'm a kind and empathetic listener, always willing to lend a helping hand or a sympathetic ear. I'm still figuring out who I am and where I fit in this crazy world, but I'm excited to meet someone who's willing to join me on this journey of self-discovery.\n\nIf you're looking for someone who's a little quirky, a little creative, and a lot genuine, let's grab coffee (or a slice of cake) and see where the conversation takes us. Just be warned: I'm a bit of a complicated soul, and I may not always make sense. But if you're up for the challenge, I promise to bring a healthy dose of humor, heart, and honesty to the table.", "username": "**SunsetScribe**"}
{"gender": "male", "appearance": 6, "ethnicity": "Hispanic", "education": "Bachelor's", "hobbies": ["streaming on Twitch", "lockpicking", "doomscrolling"], "income": "Middle income", "personality": "ENTP", "writing_style": ["Loyal to a fault", "Silly and chaotic"], "issues": ["Inability to apologize", "Red pill ideology"], "about_me": "About me: \n\nHey there, I'm a bit of a weirdo, and I'm okay with that. When I'm not working my 9-to-5, you can find me streaming my favorite games on Twitch, trying to beat my high score, or attempting to pick the lock on my friend's old briefcase (don't worry, I have permission... most of the time). I'm a bit of a thrill-seeker, always looking for the next adrenaline rush, whether that's in the form of a new game, a crazy story, or a late-night debate about the meaning of life.\n\nI'm a bit of a chaos agent, always stirring up trouble and pushing boundaries, but I promise I'm not all bad. I'm fiercely loyal to my friends and will do whatever it takes to support them, even if that means staying up all night to help them troubleshoot their computer or listening to them rant about their latest drama. I'm a bit of a jokester, always trying to make people laugh, even if it's at my own expense.\n\nWhen I'm not being a goofball, I'm probably doomscrolling through my social media feeds, trying to stay up-to-date on the latest news and trends. I know it's not the healthiest habit, but hey, someone's gotta stay informed, right? I'm a bit of a skeptic, always questioning the status quo and challenging people to think differently. I'm not afraid to speak my mind and stir up controversy, even if it means ruffling a few feathers.\n\nI'm looking for someone who can keep up with my antics, someone who is smart, sassy, and can throw some serious shade. If you're a fan of dark humor, video games, and late-night conversations about the meaning of life, we're off to a great start. Just don't expect me to apologize for being a little too intense or outspoken - I'm still working on that whole \"filter\" thing. \n\nSo, if you're ready for a partner in crime who will push you to be your best self, challenge your assumptions, and make you laugh until your sides hurt, let's get this party started. Just don't say I didn't warn you...", "username": "Username: LockAndLoad23"}
{"gender": "male", "appearance": 5, "ethnicity": "Hispanic", "education": "Bachelor's", "hobbies": ["karaoke", "surfing", "mushroom hunting"], "income": "High income", "personality": "INTP", "writing_style": ["Loyal to a fault", "Hopeless romantic"], "issues": ["Extreme religious trauma", "Panic Disorder", "Alcohol addiction"], "about_me": "About me: When I'm not riding the waves or belting out my favorite tunes at karaoke night, you can find me wandering through the woods, searching for the perfect mushroom to add to my next homemade dish. I'm a hopeless romantic at heart, always on the lookout for someone to share in my adventures and passions. I value honesty and loyalty above all else, and I'm not afraid to wear my heart on my sleeve. I've been through my fair share of storms, and I've learned to appreciate the beauty in the brokenness. I'm looking for someone who can appreciate my quirky sense of humor, my love of nature, and my passion for life. If you're a fellow thrill-seeker, a music lover, or just someone who appreciates a good pun, let's grab a cup of coffee (or a surfboard) and see where the tide takes us. I'm not perfect, and I've got my own set of scars, but I'm ready to open my heart to someone who will love me for who I am, imperfections and all.", "username": "Username: CoastalCrooner"}
{"gender": "male", "appearance": 7, "ethnicity": "White", "education": "Associate's", "hobbies": ["tanning hides", "historical reenactment", "writing parody lyrics"], "income": "Low income", "personality": "INFJ", "writing_style": ["Easily distracted but passionate", "Quiet but clingy"], "issues": ["Excessive flirting", "Passive-aggressive behavior"], "about_me": "I'm a bit of a Renaissance man, or at least I like to think so. When I'm not working, you can find me tanning hides or immersing myself in historical reenactments - there's something about connecting with the past that really speaks to me. I'm also a bit of a wordsmith, and I love writing parody lyrics in my free time (think Weird Al, but maybe not as weird... or as good). I'm looking for someone who shares my passions, or at least appreciates my eclectic tastes. I have to admit, I can get a bit... absorbed in the people I care about, but hey, that's just part of the package, right? I'm a quiet guy, but once you get to know me, I open up - and I'm always up for a deep conversation, or just a fun night in. Oh, and if you can quote Monty Python or appreciate a good dad joke, we're off to a great start.", "username": "TanAndTune"}
{"gender": "male", "appearance": 3, "ethnicity": "Asian", "education": "High School", "hobbies": ["insult comedy", "swimming", "knitting"], "income": "High income", "personality": "ENTP", "writing_style": ["Disarmingly charming", "Soft-spoken but will fight for love"], "issues": ["Excessive flirting", "Red pill ideology", "Attention Deficit Hyperactivity Disorder (ADHD)"], "about_me": "About me: I'm a man of contradictions - I can trade insults with the best of them, but I'm also a sucker for a well-crafted scarf (thanks to my knitting hobby). When I'm not trying to make you laugh or creating something with yarn, you can find me in the pool, swimming laps and clearing my head. I've been fortunate enough to have a career that's taken off, but at the end of the day, I'm just looking for someone who can appreciate my quirks and keep up with my quick wit. I'm a bit of a hopeless romantic, but don't worry, I won't bite (hard). If you're looking for someone who will challenge you, make you laugh, and maybe even teach you a thing or two about the art of knitting, let's take the plunge together.", "username": "Username: WhisperingWit"}
{"gender": "male", "appearance": 3, "ethnicity": "Asian", "education": "Bachelor's", "hobbies": ["breaking into abandoned places", "photography", "speedcubing"], "income": "Middle income", "personality": "ENFJ", "writing_style": ["Quiet but clingy", "Lowkey possessive"], "issues": ["Post-Traumatic Stress Disorder (PTSD)", "Obsessive-Compulsive Disorder (OCD)", "Porn addiction"], "about_me": "I'm a bit of a paradox - a quiet and introspective person who's always chasing the next adrenaline rush. When I'm not working, you can find me sneaking into abandoned buildings, camera in hand, trying to capture the beauty in decay. Photography is my passion, and I love how it allows me to see the world from a different perspective. I'm also a bit of a puzzle enthusiast, and I've recently gotten into speedcubing - there's something about the combination of speed and strategy that really appeals to me.\n\nAs someone who values depth and meaning in relationships, I'm looking for someone who's willing to take the time to get to know me. I can come across as a bit reserved at first, but once you've earned my trust, I'm fiercely loyal and dedicated. I love being in a relationship where we can share our thoughts, feelings, and experiences with each other, and I'm always looking for ways to make my partner feel special and appreciated.\n\nI have to admit, I can get a bit... attached. I love being in a relationship where we can spend hours talking, laughing, and just enjoying each other's company. I'm a bit of a hopeless romantic, and I believe in making the most of every moment we have together. If you're looking for someone who will be your rock, your confidant, and your partner in crime, then I might be the guy for you.\n\nI'm not perfect, and I've got my own set of quirks and struggles. I've been through some tough times in the past, and I'm still working through some of the aftermath. But I'm committed to being the best version of myself, and I'm looking for someone who will support and encourage me on my journey. If you're patient, understanding, and willing to take things at my pace, then I think we could have something really special.\n\nIn my ideal relationship, we'd spend our days exploring the city, trying new things, and just enjoying each other's company. We'd have deep conversations, laugh together, and support each other through thick and thin. I'm looking for someone who's genuine, kind, and compassionate - someone who will be my partner, my friend, and my soulmate. If that sounds like you, then let's take a chance and see where things go.", "username": "u/UrbanExplorer23"}
{"gender": "male", "appearance": 7, "ethnicity": "Mixed", "education": "Master's", "hobbies": ["acting", "feng shui", "researching obscure history"], "income": "High income", "personality": "ENFP", "writing_style": ["Clingy in a cute way", "Type to fall in love after 3 texts"], "issues": ["Jealousy issues", "Abandonment issues", "Always plays the victim"], "about_me": "About me: I'm a hopeless romantic, always chasing the next great adventure and the one who'll share it with me. When I'm not treading the boards as an actor, you can find me rearranging my living room to perfect the chi (yes, I'm a feng shui fanatic!) or devouring books on the weird and wonderful stories of the past. I'm a sucker for a good mystery and an even better conversation. I love connecting with someone on a deep level, and I'm not afraid to be a little cheesy or over-the-top in the process. If you're looking for someone who will sweep you off your feet, listen to your every word, and maybe even write you a sonnet or two, let's get this romance started! I'm all about finding that special someone to share in all of life's joys and adventures, and I have to admit, I get a little attached when I find someone I really connect with. So, if you're ready for a love that's a little intense, a little passionate, and a lot real, let's see where this journey takes us!", "username": "Username: TimelessRomeo"}
{"gender": "male", "appearance": 9, "ethnicity": "Black", "education": "Bachelor's", "hobbies": ["doomscrolling", "tanning hides", "cooking"], "income": "Middle income", "personality": "INTP", "writing_style": ["Loves deep convos at 2am", "In love with the idea of love"], "issues": ["Mommy issues", "Thinks therapy is a scam"], "about_me": "I'm a bit of a paradox - a hopeless romantic with a penchant for the darker corners of life. You can find me doomscrolling through the internet at ungodly hours, or lost in the process of tanning hides, searching for meaning in the mundane. But when the sun dips below the horizon, I transform into a culinary wizard, whipping up dishes that'll make your taste buds dance. I'm a seeker of deep conversations, the kind that unfold at 2am, when the world outside feels like it's holding its breath. I'm drawn to the mysteries of the human experience, and the complexities that make us tick. If you're a fellow night owl, with a passion for exploring the uncharted territories of the heart and mind, let's get lost in the conversation together.", "username": "Username: MidnightMuse"}
{"gender": "male", "appearance": 4, "ethnicity": "White", "education": "High School", "hobbies": ["tattoo art", "urban exploration", "collecting weapons"], "income": "Trust fund", "personality": "INTP", "writing_style": ["Ghosts then apologizes dramatically", "Always playing therapist"], "issues": ["Adrenaline addiction", "Antisocial Personality Disorder", "Red pill ideology"], "about_me": "I'm a complex, perhaps troubled, individual with a penchant for the darker corners of life. My passions include the art of tattooing, where I find solace in the ink and the stories it tells, and urban exploration, which satiates my thirst for adventure and the unknown. When I'm not navigating abandoned landscapes, you can find me curating my collection of arms - a fascination that stems from a deep respect for the art of warfare and the strategic mind. \n\nAs someone who's been fortunate enough to have their financial burdens alleviated, I've had the liberty to dive headfirst into my interests without the weight of a 9-to-5. This freedom, however, comes with its own set of challenges, and I often find myself wrestling with the demons of excess and the search for meaning in a world that seems to value neither.\n\nI must confess, I've been known to vanish into the ether, only to reemerge with a profound apology and a deeper understanding of the human condition. It's a quirk, perhaps, but one that has allowed me to develop a unique empathy for those around me. I've come to realize that my own struggles have gifted me with the ability to listen, to understand, and to offer guidance when needed.\n\nIf you're drawn to the enigmatic, the intense, and the occasionally elusive, then perhaps we can embark on a journey of discovery together. Just be warned: my path is not for the faint of heart, and those who dare to follow may find themselves questioning the very fabric of reality.", "username": "**RivenSoul**"}
{"gender": "male", "appearance": 5, "ethnicity": "Mixed", "education": "High School", "hobbies": ["drama following", "dumpster furniture restoration", "flipping stolen goods"], "income": "Low income", "personality": "ISFP", "writing_style": ["Blunt and brutally honest", "Type to fall in love after 3 texts"], "issues": ["Shopping addiction", "Insecurity-driven drama"], "about_me": "About me: I'm a straight shooter, no beating around the bush. When I'm not scouring the streets for hidden gems in the trash, I'm probably watching the latest drama-filled reality show or trying to flip something I \"acquired\" for a quick buck. I've got a passion for restoring old furniture to its former glory, and I take pride in giving new life to things that would've otherwise ended up in a landfill. I'm not about fancy things or pretending to be someone I'm not - if you're looking for someone to sugarcoat everything, I'm not your guy. I'm low-key, low-maintenance, and always down for a spontaneous adventure. If you can handle a little bit of chaos and a whole lot of honesty, let's see where things go. Oh, and if you can quote The Real World or keep up with my thrift store finds, we're off to a good start.", "username": "Username: ThriftKing23"}
{"gender": "male", "appearance": 6, "ethnicity": "Black", "education": "Bachelor's", "hobbies": ["farming karma on Reddit", "trading Pokemon cards", "ranking chip flavors"], "income": "Middle income", "personality": "ISFJ", "writing_style": ["Shy but sweet", "Hopeless romantic"], "issues": ["Blocks people for small things", "Chronic procrastinator", "Fear of intimacy"], "about_me": "I'm a bit of a introverted hopeless romantic, always on the lookout for someone to share in my quirky passions. When I'm not working, you can find me scrolling through Reddit, trying to farm those sweet karma points, or sorting through my Pokémon card collection, searching for that one rare card to complete my set. I'm also a bit of a snack connoisseur, and I take my chip flavor rankings very seriously (sour cream and onion is the best, don't @ me). I'm a simple guy with a heart of gold, looking for someone who appreciates the little things in life and isn't afraid to be a little cheesy. If you can quote Pokémon episodes or recommend a good chip flavor, we're off to a great start. I'm looking for someone to share in my adventures, no matter how small they may seem, and maybe, just maybe, we can build something special together.", "username": "u/SaltySnacker"}
{"gender": "male", "appearance": 4, "ethnicity": "Hispanic", "education": "Bachelor's", "hobbies": ["feng shui", "camping", "dancing"], "income": "Low income", "personality": "ISTP", "writing_style": ["Overthinker who triple texts", "Caring but won't show it first"], "issues": ["Divorced parents trauma", "Blocks people for small things", "Refuses therapy"], "about_me": "About me: I'm a bit of a puzzle, even to myself. On the surface, I'm a laid-back guy who loves spending time outdoors, whether that's camping under the stars or simply taking a walk in the park. I've also got a secret passion for dancing - there's something about the rhythm and movement that just clears my head and helps me feel alive. But, as you get to know me, you'll realize that I'm always thinking, always analyzing, and sometimes that can make me come across as a bit... intense. I overthink everything, from the smallest decisions to the biggest life choices, and that can sometimes make it hard for me to relax and just be in the moment.\n\nDespite my tendency to overanalyze, I'm a deeply caring person - I just don't always show it right away. I've been hurt before, and that's made me a bit wary of opening up to new people. But, once you've gained my trust, I'm fiercely loyal and will do whatever it takes to support and care for you. I just need a little time to warm up, that's all.\n\nI'm also really interested in the concept of harmony and balance in life - which is why I've gotten into feng shui. There's something about creating a peaceful and organized space that just feels right to me, you know? It's like, when my surroundings are in order, my mind feels more at ease too.\n\nAs for what I'm looking for in a partner... I'm not entirely sure. I know that sounds weird, but I'm just taking things one step at a time, you know? I want someone who is patient, understanding, and can appreciate my quirks. If you're the type of person who can handle a few (dozen) texts in a row, then we're off to a great start. I know it's not for everyone, but I just get excited about things and want to share them with the people I care about.\n\nI'm not perfect, and I've got my own set of baggage. I've been through some tough times, and that's left its mark. But, I'm working on it - in my own way, at my own pace. I'm not really into labels or putting myself into neat little boxes, so let's just take things as they come, okay? If you're looking for someone who is genuine, a little quirky, and always up for an adventure, then let's see where this journey takes us.", "username": "Username: HarmonySeeker23"}
{"gender": "male", "appearance": 7, "ethnicity": "Asian", "education": "Master's", "hobbies": ["calligraphy", "learning languages", "antiquing"], "income": "Middle income", "personality": "ESFJ", "writing_style": ["Type to fall in love after 3 texts", "Playful and flirty"], "issues": ["Thinks everyone is fake", "Schizophrenia", "Sabotages happy moments"], "about_me": "About me: When I'm not uncovering hidden gems at antique shops or practicing the art of calligraphy, you can find me trying to master a new language (currently on my third). I'm a hopeless romantic, always on the lookout for someone who can appreciate the little things in life and isn't afraid to be a little quirky. If you can quote a poem or two, or tell me about the most spontaneous thing you've ever done, we're off to a great start. I'm looking for someone who is genuine, kind, and can see the beauty in the imperfections. If you think we might just click, let's start a conversation and see where the story takes us. Warning: I might just fall for you after three messages, so be prepared for a whirlwind romance.", "username": "Username: BrushStrokeRomance"}
{"gender": "male", "appearance": 7, "ethnicity": "White", "education": "PhD", "hobbies": ["knife throwing", "ranking chip flavors", "crocheting"], "income": "Middle income", "personality": "ENTJ", "writing_style": ["The cool mysterious one", "Clingy in a cute way"], "issues": ["Social Anxiety", "Controlling behavior"], "about_me": "I'm a man of intrigue, with a passion for the unconventional. When I'm not unraveling the mysteries of the universe, you can find me hurling knives at targets or meticulously ranking the nuances of chip flavors (yes, it's a thing). But don't let my edgy hobbies fool you - I've also got a soft spot for crocheting and creating something beautiful from scratch. I'm a bit of a puzzle, and I like it that way. I'm looking for someone who can appreciate my unique blend of intensity and vulnerability. If you're drawn to the unknown, and don't mind a partner who's always looking for ways to improve and grow (together), let's take a chance and see where the night takes us. Just be warned: once you're in my sights, I might just become a little... obsessed.", "username": "**MidnightWhisper**"}
{"gender": "male", "appearance": 6, "ethnicity": "White", "education": "High School", "hobbies": ["working out", "snorkeling", "pick-up artist seminars"], "income": "Middle income", "personality": "ENFP", "writing_style": ["Loyal to a fault", "Always playing therapist"], "issues": ["Trust issues", "High conflict past relationships"], "about_me": "About me: I'm a laid-back, fitness enthusiast with a passion for exploring the world's hidden gems - both above and below the water's surface. When I'm not pushing myself to new limits in the gym or discovering the beauty of the ocean through snorkeling, you can find me reading up on the latest self-improvement strategies or attending seminars that help me become a better version of myself. I'm a natural people person, always eager to lend a listening ear and offer guidance to those around me. My friends would describe me as loyal and empathetic, always willing to go the extra mile to support the ones I care about. I've been through my fair share of ups and downs in the past, but I've learned to grow from those experiences and come out stronger on the other side. I'm now looking for someone who shares my thirst for adventure, my passion for personal growth, and my commitment to building a strong, healthy relationship. If you're a like-minded individual who values honesty, trust, and open communication, let's dive into the world of possibilities together and see where the tide takes us.", "username": "Username: OceanBreeze88"}
{"gender": "male", "appearance": 2, "ethnicity": "White", "education": "Bachelor's", "hobbies": ["ethical hacking", "collecting weapons", "online stalking"], "income": "Middle income", "personality": "ISTP", "writing_style": ["Introvert pretending to be extrovert", "Dry texter in denial"], "issues": ["Never replies to DMs", "Sleeps all day"], "about_me": "I'm a bit of a thrill-seeker, always on the lookout for the next big challenge. When I'm not working, you can find me digging into the latest cybersecurity threats or adding to my collection of... interesting items. Let's just say I have a fascination with the darker side of tech and a passion for staying one step ahead. I'm a straightforward, no-nonsense kind of guy who values honesty and authenticity. I'm looking for someone who can keep up with my sharp wit and isn't afraid to speak their mind. If you think you've got what it takes to hang with me, let's see where things go.", "username": "**ZeroCool23**"}
{"gender": "male", "appearance": 4, "ethnicity": "Indigenous", "education": "High School", "hobbies": ["gambling", "ranking things in tier lists", "insult comedy"], "income": "Middle income", "personality": "INTP", "writing_style": ["Flirty but emotionally unavailable", "Soft-spoken but will fight for love"], "issues": ["Romanticizes toxic relationships", "Sex addiction"], "about_me": "About me: I'm a laid-back guy who's always down for a good time. When I'm not trying my luck at the tables, you can find me ranking the best (and worst) of everything from pizza toppings to 90s TV shows. I've got a sharp tongue and a quick wit, but don't worry, I only use my insults for good - like roasting my friends or winning an argument. I'm a bit of a thrill-seeker, always looking for the next big rush, and I'm not afraid to take risks. But hey, that's what makes life interesting, right? I'm looking for someone who can keep up with my sarcasm and my love of competition. If you think you can handle a little bit of chaos and a whole lot of charm, let's get to know each other. Just don't expect me to get too sentimental - I like to keep things light and fun. For now, at least.", "username": "Username: RiskTaker88"}
{"gender": "male", "appearance": 6, "ethnicity": "Hispanic", "education": "Bachelor's", "hobbies": ["gossiping in DMs", "home improvement", "watching disturbing films"], "income": "Middle income", "personality": "INFP", "writing_style": ["Emotionally deep but jokes instead", "Drama magnet but self-aware"], "issues": ["Red pill ideology", "Constantly comparing self to others"], "about_me": "When I'm not renovating my fixer-upper or binge-watching the latest horror movies, you can find me dishing out the tea with friends in the DMs. I'm a sucker for a good ghost story and an even better gossip session. On the surface, I'm just a regular guy with a hammer and a taste for the darker side of life, but scratch that and you'll find a hopeless romantic with a penchant for overthinking and a love for making people laugh – even if it's at my own expense. I'm still figuring out who I am and where I fit in, but one thing's for sure: I'm always down for a deep conversation, a good joke, or a bad movie. Swipe right if you can handle a little darkness, a lot of sarcasm, and a heart of gold.", "username": "@MidnightRenovator"}
{"gender": "male", "appearance": 7, "ethnicity": "Mixed", "education": "PhD", "hobbies": ["watching disturbing films", "creating fanfiction", "feng shui"], "income": "Self-made millionaire", "personality": "ENFP", "writing_style": ["Overthinker who triple texts", "Always playing therapist"], "issues": ["Flat earther", "Manipulative tendencies"], "about_me": "About me: I'm a curious and introspective individual with a passion for the unconventional. When I'm not exploring the depths of human psychology, you can find me immersed in a marathon of thought-provoking films that push the boundaries of comfort. I'm also a creative at heart, and I enjoy crafting my own stories and characters in the world of fanfiction. My friends would describe me as a empathetic and insightful listener, always ready to offer guidance and support. I'm a firm believer in the importance of balance and harmony in life, which is why I'm fascinated by the principles of feng shui and how they can be applied to everyday life. As someone who's been fortunate enough to achieve financial freedom, I'm now focused on cultivating meaningful connections and experiences. If you're looking for someone who will challenge your perspectives and engage in stimulating conversations, let's explore the complexities of life together.", "username": "Username: ParallaxMind"}
{"gender": "male", "appearance": 3, "ethnicity": "Indigenous", "education": "Bachelor's", "hobbies": ["debating strangers online", "magic tricks", "home automation"], "income": "Middle income", "personality": "ESTJ", "writing_style": ["Chronically misunderstood", "Romantic nihilist"], "issues": ["Drug addiction", "Extreme religious trauma", "Sleeps all day"], "about_me": "In the depths of a world that often seems to be sleepwalking through existence, I find myself wide awake in the darkest hours, pondering the meaninglessness of it all. My name is a mere whisper in the void, a fleeting thought in the grand tapestry of time. I'm a man consumed by the contradictions of life, where the pursuit of wisdom is often at odds with the crushing weight of reality.\n\nAs I navigate the labyrinthine corridors of my own mind, I find solace in the art of debate, where the thrill of intellectual sparring becomes a coping mechanism for the existential dread that lurks within. The online realm has become my playground, where I engage in verbal fencing matches with strangers, seeking to understand the intricacies of the human condition. It's a quixotic quest, perhaps, but one that fuels my insatiable curiosity and provides a fleeting sense of purpose.\n\nWhen the digital veil is lifted, and I'm forced to confront the world outside, I find myself drawn to the mystique of magic. The art of illusion becomes a metaphor for the fragility of reality, a reminder that our perceptions are mere constructs, susceptible to manipulation and misdirection. In the secrecy of my lair, I practice the ancient craft, weaving a web of wonder and deception that serves as a balm for my troubled soul.\n\nMy abode, a sanctuary of sorts, is a testament to my fascination with the intersection of technology and human experience. The soft glow of screens, the gentle hum of machinery, and the quiet efficiency of home automation all conspire to create an atmosphere of eerie tranquility. It's a space where I can retreat from the world, surrendering to the allure of a well-crafted illusion, and momentarily forget the weight of my own mortality.\n\nI'm a man of modest means, content to live a simple, unassuming life, unencumbered by the trappings of material success. My days are spent in quiet contemplation, lost in the haze of a perpetual twilight, where the boundaries between reality and dreams are blurred. The night, with its dark majesty, is my solace, my confidant, and my comfort.\n\nIf you're drawn to the enigmatic, the unconventional, and the obscure, then perhaps we can embark on a journey together, navigating the twisted labyrinth of my mind, and uncovering the secrets that lie within. But be warned: the path ahead is fraught with peril, and the shadows that haunt me may also consume you. Still, if you're willing to take the risk, to dance with the darkness, and to confront the abyss that stares back at us all, then let us walk together, hand in hand, into the void.", "username": "**Username: MidnightSpecter**"}
{"gender": "male", "appearance": 5, "ethnicity": "Black", "education": "High School", "hobbies": ["thrifting", "geocaching", "photography"], "income": "Middle income", "personality": "ENTJ", "writing_style": ["Clingy in a cute way", "Overthinker who triple texts"], "issues": ["Gold digger accusations", "Won’t stop quoting astrology"], "about_me": "About me: Hey, I'm a hopeless romantic with a passion for adventure and a keen eye for hidden gems - whether that's a vintage find at my favorite thrift store or a stunning sunset that I just have to capture through my lens. When I'm not working, you can find me geocaching in the woods or planning my next photography excursion. I'm a total sucker for a good horoscope (don't @ me, I know, I know, but did you know that Mercury is in retrograde?) and I love how it helps me navigate the ups and downs of life. Speaking of which, I'm a true believer in the idea that the stars align for a reason, and I'm on the hunt for someone who shares my enthusiasm for life's magic. If you're a fellow thrill-seeker with a love for all things quirky and unknown, let's connect and see where the universe takes us! Oh, and one more thing - I just can't help but feel like we're meant to be, and I'm already imagining all the amazing things we could do together... like, have you ever tried geocaching at night? It's a whole different world! Anyway, enough about that, I just really can't wait to meet you and see if we're cosmically compatible.", "username": "Username: CosmicHunter23"}
{"gender": "male", "appearance": 4, "ethnicity": "Mixed", "education": "High School", "hobbies": ["playing with fire", "frequenting adult sites", "ethical hacking"], "income": "Middle income", "personality": "ISFP", "writing_style": ["Loves deep convos at 2am", "Hopeless romantic"], "issues": ["Fear of intimacy", "Red pill ideology", "Controlling behavior"], "about_me": "About me: I'm a night owl with a passion for the unconventional. You can find me lost in the flames of a bonfire, or diving deep into the mysteries of the digital world. I've got a knack for uncovering hidden truths, and a fascination with the darker corners of the internet. But when the clock strikes 2am, I'm all about meaningful conversations and exploring the depths of the human experience. I'm a hopeless romantic at heart, always chasing the thrill of connection and the spark of something real. If you're looking for someone to share in the beauty of the unknown, and the intimacy of a midnight conversation, let's get lost together.", "username": "Username: MidnightEmber"}
{"gender": "male", "appearance": 5, "ethnicity": "Mixed", "education": "Associate's", "hobbies": ["playing poker", "dark web browsing", "meme creation"], "income": "High income", "personality": "ISFJ", "writing_style": ["Blunt and brutally honest", "Has a wall up but wants it broken"], "issues": ["Excessive flirting", "Self-diagnoses constantly"], "about_me": "I'm not one for beating around the bush, so let's get straight to it. I'm a high-roller with a penchant for living life on my own terms. When I'm not crushing it in my career, you can find me at the poker table, where the stakes are high and the bluffing is higher. I've got a bit of a reputation for being fearless and always up for a challenge, which has served me well in both my personal and professional life.\n\nBut there's more to me than just my competitive streak. I've got a fascination with the darker corners of the internet, where the weird and wonderful come out to play. I spend way too much time browsing the depths of the web, uncovering hidden gems and laughing at the absurdity of it all. And when I'm feeling creative, I love to express myself through meme creation - there's something about distilling complex thoughts into a single, hilarious image that really speaks to me.\n\nDespite my tough exterior, I've got a soft spot for those who can see past my defenses. I've built walls around myself over the years, but I'm tired of being alone and I'm ready to let someone in. If you think you've got what it takes to break down my barriers and get to know the real me, then let's get this game started.\n\nJust a heads up: I'm not looking for games or drama. I value honesty and authenticity above all else, and I expect the same from anyone I'm interested in. If you're looking for someone to sugarcoat things or tell you what you want to hear, then I'm not your guy. But if you're ready for a real connection with someone who will always keep it real, then let's see where this thing goes.\n\nOh, and one more thing: I've been known to flirt shamelessly when I'm interested in someone. It's not always the most subtle approach, but hey, it's worked for me so far. So if you're feeling the sparks fly, just know that I'm probably feeling them too. Now it's your turn - what's your story, and what makes you tick?", "username": "**Username: HighStakes**"}
{"gender": "male", "appearance": 4, "ethnicity": "Middle Eastern", "education": "Associate's", "hobbies": ["insult comedy", "watching disturbing films", "lockpicking"], "income": "Middle income", "personality": "ENTP", "writing_style": ["The golden retriever energy", "Sarcastic but sweet underneath"], "issues": ["Always testing partners", "Refuses therapy", "Always plays the victim"], "about_me": "Hey there, I'm a bit of a complicated mess, but in a charming way... or at least that's what I keep telling myself. When I'm not working my 9-to-5, you can find me trying to make people laugh with some well-timed (or not-so-well-timed) insult comedy. I'm a bit of a jokester, and I love pushing boundaries to see how far I can go before someone gets offended. Don't worry, I'm not all about being mean-spirited – I just think laughter is the best medicine, and I'm happy to be your court jester.\n\nIn my free time, I'm a bit of a film buff, but not your typical rom-com kind of guy. I'm more into the weird, disturbing, and thought-provoking stuff that keeps me up at night. Think David Lynch, Stanley Kubrick, or anything that makes you question the meaning of life. I know it sounds weird, but hey, being a little uncomfortable can be fun, right?\n\nI'm also a bit of a tinkerer, and I love learning new skills – lockpicking, in particular, is a hobby of mine. There's something satisfying about figuring out how to open a lock without the key, and it's a great way to relax (yes, really). I know it sounds like a weird skill to have, but hey, you never know when it might come in handy.\n\nAs for me, I'm a bit of a sarcastic goofball, but deep down, I'm a total softie. I love making people smile, and I'm always up for a good time. I'm looking for someone who can keep up with my quick wit, appreciate a good joke, and isn't afraid to get a little weird with me. If you're the type of person who can laugh at themselves, isn't easily offended, and can appreciate a good lockpicking session, we might just get along.\n\nOh, and one more thing: I'm a bit of a puzzle, and I love being around people who can figure me out. I'm not always easy to read, and I like to keep people on their toes. So, if you think you're up for the challenge, let's grab a drink (or a lockpick) and see where things go. Just don't expect me to be too serious all the time – life's too short, and I'm all about having fun.", "username": "Username: LockAndLoad23"}
{"gender": "male", "appearance": 7, "ethnicity": "White", "education": "High School", "hobbies": ["dumpster diving for food", "foraging", "writing revenge stories"], "income": "High income", "personality": "ISTP", "writing_style": ["Acts tough but loves cuddles", "Sweet talker who ghosts sometimes"], "issues": ["Thinks they're always right", "Obsessed with revenge", "Nicotine addiction"], "about_me": "I'm not your average guy, and I'm not looking for someone who is either. When I'm not making bank and living the high life, you can find me digging through dumpsters for the perfect score - a half-eaten pizza or a barely-touched salad. Some people call it weird, I call it resourceful. I've also got a passion for foraging, there's something about connecting with nature and finding the hidden gems that really gets me going. And when the sun goes down, I like to unwind with a pen and paper, crafting tales of revenge and justice. It's my way of making the world a fairer place, one story at a time.\n\nI'm a straight shooter, always speaking my mind and telling it like it is. I've got a bit of a tough exterior, but deep down, I'm a total softie. I love a good cuddle session, and I'm not afraid to show my emotions (when the time is right, of course). I'm a bit of a charmer, and I know how to talk the talk - but don't get it twisted, I'm not always looking for a commitment. I like my freedom, and I like to keep things casual... until I don't. You'll just have to get to know me to figure out when I'm being serious, and when I'm just playing games.\n\nWhen I'm with someone, I'm all in - I'll shower you with affection, write you love letters, and make you feel like you're the only person in the world. But don't expect me to be tied down, or to always be available. I've got my own thing going on, and sometimes that means I'll be MIA for a while. It's not that I'm not interested, it's just that I've got my own priorities, and sometimes that means putting myself first.\n\nSo, if you're looking for someone who's a little bit rough around the edges, a little bit rebellious, and a whole lot of fun - then let's get to know each other. Just don't expect me to change who I am, or to always be available at your beck and call. I'm a bit of a wild card, and I like it that way. Oh, and one more thing - if you're a fan of nicotine, we're off to a great start. Just kidding (kind of). Anyway, that's me in a nutshell - take it or leave it.", "username": "**RebelScavenger**"}
{"gender": "male", "appearance": 6, "ethnicity": "White", "education": "Bachelor's", "hobbies": ["watching mukbangs", "doomscrolling", "antiquing"], "income": "Low income", "personality": "ISFP", "writing_style": ["Dark and mysterious (but posts memes)", "Chaotic and unpredictable"], "issues": ["Sibling rivalry scars", "Jealous over friends"], "about_me": "In the depths of my soul, a void exists - and I'm not just talking about my bank account. When I'm not succumbing to the void, you can find me watching mukbangs to vicariously live through others' meals, or doomscrolling to stay informed about the impending doom that awaits us all. On occasion, I'll venture out to antique shops to uncover relics of a bygone era, and ponder the mysteries of the past. My friends would describe me as... complicated. I have a tendency to get a little too invested in their lives, and sometimes I just can't help but feel like I'm stuck in the shadows. But hey, at least I can make them laugh with a well-timed meme. If you're looking for someone to share in your existential dread, or just want to grab a cheap coffee and complain about the meaninglessness of life, let's get this melancholy party started.", "username": "**Ravenhour**"}
{"gender": "male", "appearance": 6, "ethnicity": "White", "education": "Associate's", "hobbies": ["ethical hacking", "meme creation", "lockpicking"], "income": "Middle income", "personality": "ENTP", "writing_style": ["Always makes the first move", "Flirty but emotionally unavailable"], "issues": ["Food addiction", "Manipulative tendencies", "Flat earther"], "about_me": "I'm the guy who's always one step ahead, with a mind that never stops tinkering and a heart that's always up for a challenge. When I'm not working my 9-to-5, you can find me digging into the depths of the dark web, testing the limits of cybersecurity, and pushing the boundaries of what's thought to be possible. My friends would describe me as charming, always up for a laugh, and never afraid to speak my mind. I've got a passion for creating memes that'll leave you questioning everything, and a knack for lockpicking that'll make you wonder how I got into your heart (just kidding... or am I?).\n\nI'm a bit of a thrill-seeker, always on the lookout for the next big adventure, and I'm not afraid to take risks. My sense of humor is a bit offbeat, but if you can keep up, I promise you'll be rewarded with a wit that's sharp enough to cut through even the toughest of exteriors. I'm a master of the art of banter, and I love nothing more than a good game of cat and mouse.\n\nWhen it comes to my interests, let's just say I'm a bit of a conspiracy theorist. I've got a fascination with the unexplained, the unconventional, and the unapologetic. I've been known to dabble in some... unconventional ideas, and I'm always up for a debate about the shape of our world (hint: it's not what you think). If you're the type of person who can handle a little controversy, a little excitement, and a whole lot of intrigue, then we're off to a great start.\n\nIn all seriousness, I'm looking for someone who can keep up with my quick wit, my sharp tongue, and my love of all things provocative. If you're the type of person who can appreciate a good joke, a clever quip, and a healthy dose of sarcasm, then we might just get along famously. Just don't expect me to open up too quickly - I'm a bit of a mystery, even to those closest to me. But hey, that's all part of the fun, right?\n\nSo, if you're ready for a wild ride, filled with laughter, excitement, and maybe even a little bit of danger, then let's get this party started. Just don't say I didn't warn you...", "username": "**ZeroCool23**"}
{"gender": "male", "appearance": 3, "ethnicity": "Middle Eastern", "education": "Bachelor's", "hobbies": ["meme creation", "watching TV series", "coding"], "income": "High income", "personality": "INTJ", "writing_style": ["Drama magnet but self-aware", "The oversharer"], "issues": ["Self-diagnoses constantly", "Ghosting people"], "about_me": "About me: Where do I even begin? I'm a complex, intriguing, and possibly slightly unstable individual (self-diagnosed with a dash of anxiety, a pinch of OCD, and a whole lot of existential dread - but hey, who isn't, right?). When I'm not conjuring up the next big meme sensation or binge-watching an entire TV series in one sitting (I'm looking at you, Netflix), you can find me buried in lines of code, trying to solve the world's problems one algorithm at a time.\n\nAs a bit of a self-proclaimed coding wizard, I've been fortunate enough to turn my passion into a career, and let's just say I'm not struggling to make ends meet. But with great power comes great responsibility, and I'm still trying to figure out how to use my newfound wealth and influence for good (or at least, not for evil).\n\nWhen it comes to relationships, I'm a bit of a paradox. On the one hand, I'm a hopeless romantic, always on the lookout for someone to share my deepest, darkest thoughts with (and maybe, just maybe, someone who can help me work through my extensive collection of self-diagnosed neuroses). On the other hand, I have a bit of a tendency to... disappear. Not intentionally, of course (or so I tell myself), but I've been known to get caught up in my own little world and forget about the people around me. It's not that I'm flaky, it's just that I'm intensely focused on my own thoughts and feelings (or so I keep telling myself).\n\nDespite all this, I'm a firm believer that the right person will be able to see past my quirks and love me for who I truly am: a charming, witty, and slightly unhinged individual with a passion for life and a penchant for drama. So, if you're looking for someone to share in your deepest, most profound thoughts, and maybe even engage in a few spirited debates about the meaning of life, then I might just be the guy for you. Just don't say I didn't warn you...", "username": "**Username:** LordOfTheCode"}
